[["Map",1,2,9,10,372,373,446,447,504,505],"meta::meta",["Map",3,4,5,6,7,8],"astro-version","5.16.5","content-config-digest","17a5928e2b0a62e2","astro-config-digest","{\"root\":{},\"srcDir\":{},\"publicDir\":{},\"outDir\":{},\"cacheDir\":{},\"site\":\"https://rounak.taptappers.club\",\"compressHTML\":true,\"base\":\"/\",\"trailingSlash\":\"ignore\",\"output\":\"static\",\"scopedStyleStrategy\":\"attribute\",\"build\":{\"format\":\"directory\",\"client\":{},\"server\":{},\"assets\":\"_astro\",\"serverEntry\":\"entry.mjs\",\"redirects\":true,\"inlineStylesheets\":\"auto\",\"concurrency\":1},\"server\":{\"open\":false,\"host\":false,\"port\":4321,\"streaming\":true,\"allowedHosts\":[]},\"redirects\":{},\"image\":{\"endpoint\":{\"route\":\"/_image\"},\"service\":{\"entrypoint\":\"astro/assets/services/sharp\",\"config\":{}},\"domains\":[],\"remotePatterns\":[],\"responsiveStyles\":false},\"devToolbar\":{\"enabled\":true},\"markdown\":{\"syntaxHighlight\":{\"type\":\"shiki\",\"excludeLangs\":[\"math\"]},\"shikiConfig\":{\"langs\":[],\"langAlias\":{},\"theme\":\"github-light\",\"themes\":{},\"wrap\":true,\"transformers\":[]},\"remarkPlugins\":[],\"rehypePlugins\":[],\"remarkRehype\":{},\"gfm\":true,\"smartypants\":true},\"security\":{\"checkOrigin\":true,\"allowedDomains\":[]},\"env\":{\"schema\":{},\"validateSecrets\":false},\"experimental\":{\"clientPrerender\":false,\"contentIntellisense\":false,\"headingIdCompat\":false,\"preserveScriptOrder\":false,\"liveContentCollections\":false,\"csp\":false,\"staticImportMetaEnv\":false,\"chromeDevtoolsWorkspace\":false,\"failOnPrerenderConflict\":false,\"svgo\":false},\"legacy\":{\"collections\":false}}","notes",["Map",11,12,65,66,104,105,146,147,204,205,245,246,289,290,353,354],"alexander-nixinton",{"id":11,"data":13,"body":20,"filePath":21,"digest":22,"rendered":23},{"title":14,"date":15,"tags":16,"draft":19},"Alexander Nixinton",["Date","2024-04-19T00:00:00.000Z"],[17,18],"open-source","nix",false,"We are at yet another article about [Nix](https://nixos.org/) - it is a casual attempt to walk you through how it is to use Nix everyday. I also intend to put my two cents into why most people like staying away from it, why a handful are happily sacrificing their weekends over it, and why some blokes are just willing to silently ride the wave. As the homepage says, Nix is both your programming language and the framework. The pitch is that if you're building and maintaining software for a long-ish term, then you'd like to minimize surprises and keep some old gears rotating as if for ever. Packaging using Nix sorta guarantees that. Yes, and the other niceties like being \"declarative\" are great, but seemingly many people don't deeply care about that. Ultimately I'm trying to rant here on how beautiful the Nix ecosystem is, and walk you through the possibilities that could get unlocked.\n\nAs a long-time lurker on Nix-related blogposts on HN, I decided to give it a roller-coaster try last year by installing NixOS on my personal laptop. Well, while one can install Nix on an existing Linux/MacOS operating system as an application layer, however that path can be deceptive to shortcuts. I wanted to be true to the declarative and immutability properties of Nix, and therefore chose the hard way.\n\n## The first leap into the valley of despair\n\n### Brewing fresh, hot, cutting (edge) NixOS on my personal laptop\n\nThe enthusiastic journey of installing NixOS (not really unexpectedly) landed into a valley of despair for me. One needs to speak the Nix language, somewhat understand the build process and pick up the right constructs of organizing the setup script - all at the same time. By setup script, we mean the codebase which initially would bootstrap your system, and which ultimately evolves into your all-encompassing dotfiles repository. The core Nix framework is stable, but decisions on whether to choose the new Flake way of packaging or the legacy way of packaging are some decisions that have to be well thought through. Truth to be told, I initially had decided to go with the [Hyprland](https://github.com/hyprwm/Hyprland) window manager, but that route cost me almost half of a Saturday. Plain, old GNOME (as always) came to my rescue. The lesson is that, while trekking a new, steep mountain, always find that base camp first, and attempt all adventures from there, so that backtrackings are less painful.\n\nAt this juncture it is also worth mentioning the project home-manager, which allows you to configure your user directory with a lot of ease. You get to carefully choose which all programs are to be installed at a system level, and which all are to be installed specific to user. Here's a snippet to describe how elegant it is to configure most of your daily use programs. The `home` block enclosing signifies that these settings indeed would be specific to a particular user.\n\n```nix\nhome = {\n  programs = {\n    htop = {\n      enable = true;\n      settings.color_scheme = 6;\n    };\n\n    Password-store = {\n      enable = true;\n    };\n  };\n};\n```\n\nIt must be wholeheartedly acknowledged that ChatGPT as well has Phind came very useful throughout the journey - not just helping me in getting familiar with the concepts, but also writing and composing small snippets of Nix programs into however I needed. My current dotfiles repository is essentially an opinionated tapestry of many other repositories handpicked via GitHub Search and the [Nix Discourse](https://discourse.nixos.org/).\n\n### Expressing all your logic and state via Nix\n\nThe promise of Nix just like other infrastructure-as-code frameworks is that you declaratively define what all your need. The framework then takes care of generating the dependency graph, and chalks its way through to creating / modifying the required components as missing. The fact that in NixOS you can rollback to *any* past state (including the Linux kernel) is mindblowing! One also should take a moment to appreciate how vast and wholesome the [Nixpkgs](https://search.nixos.org/packages) repository is - often you'd be mildly surprised at how the rarest of rare packages has landed up on Nixpkgs (and very often with first-class support for `aarch64-darwin` i.e. Apple Silicon) - all community contributed!\n\n```shell\n# this is how you apply your configuration to a NixOS system\nnixos-rebuild switch --flake .\n```\n\nThe standard pattern of managing dotfiles is to have a repository consisting of them, and then a bootstrapping program like GNU Stow or Ansible bakes them onto the system. This approach invites duplicacy when there are more than one flavours of the underlying system - one can't possibly embed an if/else logic (across say x86_64 and aarch64) into that innocent dotfile. And this is an area where Nix shines! The configuration (dotfile) and the bootstrapping framework (Nix) are fused into one, so defining logic is very straightforward. Fair to call out here that when you're \"baking\" your configuration dotfiles via Nix, they're immutable and cannot be directly edited. That is, one can't take a shortcut to modify configurations, and instead should build the entire system every time. A snippet follows to bring the point home:\n\n```nix\n{ configs, pkgs, ... }:\nlet\n  isDarwin = pkgs.stdenv.isDarwin;\nin\n{\n  programs.tmux = {\n    enable = true;\n    extraConfig = ''\n        set ...\n        # all your over-engineered tmux configs go here\n        set ...\n    ''\n    +\n    (if isDarwin then\n      ''\n        # darwin-specific command to figure out battery details\n        tm_battery=\"♥ #(pmset -g batt)\"\n      ''\n    else\n      ''\n        # linux-specific command to figure out battery details\n        tm_battery=\"♥ #(acpi --battery)\"\n      ''\n    );\n  }\n}\n```\n\n### The real world isn't so declarative and not always deterministic\n\nWhile most software configurations are happy to work in a declarative way, you might occasionally come across odd-shaped pieces. Non-declarative patterns are considered *dirty* in Nix, nevertheless it is supported as a concept called `activations`. One should however keep in mind that operating systems are not declarative inherently, so Nix is doing all the hard work of doing the sequential step and providing a neat declarative abstraction of that to us.\n\nHere's a small example of what the neat declarative abstraction allows us:\n\n```nix\nprograms.gpg = {\n  enable = true;\n}\n\nservices.gpg-agent = {\n  enable = true;\n  pinentryFlavor = \"gnome3\";\n  enableSshSupport = true;\n}\n```\n\nHaving said that, if your requirement is to have sequential steps, you generally achieve that via activations for specific portions something like the following snippet. Make sure to take enough care that the code block is idempotent as it would be run every time yourr configuration gets re-built.\n\n```nix\n  home.activation = {\n    doomEmacs = ''\n      DOOM=\"$HOME/.emacs.d\"\n\n      if [ ! -d \"$DOOM\" ]; then\n          mkdir -p \"$DOOM\"\n      fi\n      cd $DOOM\n\n      export PATH=\"${config.home.path}/bin:$PATH\"\n\n      git init\n      if git remote | grep -q origin; then\n          git remote set-url origin https://github.com/doomemacs/doomemacs.git\n      else\n          git remote add origin https://github.com/doomemacs/doomemacs.git\n      fi\n\n      git fetch origin\n      git pull origin master\n      ...\n    '';\n  };\n```\n\n## Emerging victorious and onto the next - iMountains and iValleys\n\nThe months-long experiment with Nix on my personal laptop was a rewarding success, and that called for the next step - *using Nix in production a.k.a at work*. There's this lovely community-maintained project [nix-darwin](https://github.com/LnL7/nix-darwin) which allows you to achieve a somewhat similar setup, albeit via the application layer. Unlike NixOS where you could literally rollback upgrades to your kernel and is fool-proof-declarative, on nix-darwin you can manage all your application installations, your configuration dotfiles as well as many macOS settings. Impressively, nix-darwin supports Homebrew as well as mas (Mac Apple Store) application installations. Sure, one can't configure disk partitions, macOS upgrades and initial manual steps (like logging in to Apple account) using nix-darwin, but that's a trade-off worth living with.\n\n```shell\n# this is how you apply your configuration to a macOS system\ndarwin-rebuild switch --flake .\n```\n\n## Nixy Science\n\n### Development environments and short-lived environments\n\nNix development environments (as well as shells) are one of the most impressive things to happen out of the immutability properties of the system. On a single occasion, I needed the Wireshark program for a day or two, and all I had to do was `nix-shell -p wireshark`. All the user-data produced by that program gets gracefully garbage-collected once you've exited that temporary shell. One no longer doesn't have to deal around with different versions of the JRE, or confusingly-installed global npm packages.\n\nAnd while nix shells are more for ad-hoc purposes, one can carefully craft Flakes for specific projects which would serve as the development environment template. Flakes can lock in the versions of each package, so they don't outdate with time. Last year, I attempted [Advent of Code](https://adventofcode.com/) in OCaml and decided to try out Nix development environments - super impressed!\n\n```nix\n{\n  description = \"AOC OCaml programming environment presented to you by Nix\";\n\n  inputs = {\n    nixpkgs.url = \"github:NixOS/nixpkgs/nixos-unstable\";\n    flake-utils.url = \"github:numtide/flake-utils\";\n  };\n\n  outputs = { self, nixpkgs, flake-utils, ... }:\n    flake-utils.lib.eachDefaultSystem (system:\n      let\n        pkgs = nixpkgs.legacyPackages.${system};\n        ocamlEnv = with pkgs.ocamlPackages; [\n          ocaml\n          utop\n          dune_3\n          findlib\n          ocaml-lsp\n          ocamlformat\n        ];\n      in\n      {\n        devShell = pkgs.mkShell {\n          buildInputs = ocamlEnv ++ [ pkgs.opam ];\n          shellHook = ''\n            export IN_NIX_DEVELOP_SHELL=1\n\n            export OPAMROOT=$NIX_BUILD_TOP/.opam\n            # unsetting the below env var is required for fixing a thorny issue with `num` install\n            # similar issue & solution thread: https://github.com/ocaml/Zarith/issues/136\n            unset OCAMLFIND_DESTDIR\n\n            opam init --bare --disable-sandboxing -y --shell-setup -vv\n            opam option -global depext=false\n            OCAML_VERSION=$(ocaml --version | awk '{printf $5}')\n            opam switch create $OCAML_VERSION\n            eval $(opam env --switch=$OCAML_VERSION)\n            opam install . --deps-only -y -v\n\n            # figure out what the default shell of this computer is and set it\n            SHELLY=$(getent passwd $USER | awk -F: '{printf $7}')\n            exec $SHELLY\n          '';\n        };\n      }\n    );\n}\n```\n\n### Secrets management\n\nThis is an area which is still work-in-progress for me. There exists great tooling like [sops-nix](https://github.com/Mic92/sops-nix), [agenix](https://github.com/yaxitech/ragenix) for injecting secret values into your Nix project. Common use cases might be auto-configuring API keys, setting up your private keys at the required paths, bootstrapping local database client and local password store and so on. The best thing about this declarative design is that your secrets would be encrypted and [tombed](https://dyne.org/software/tomb/) on-device, and you can conveniently commit them to git.\n\n### Endless automation\n\nNix offers the scope for endless automation - behold your imaginations! You could write simple scripts and then tie them on to `launchd` / `systemd` to run them periodically and what not. Writing scheduled scripts on UNIX have existed since forever, but the ability to confidently deploy them using Nix on personal computers is something that's impressively an emerging capability to me. Nix brings to personal computers what Packer / AWS AMIs brought to server computing.\n\nI have a self-hosted software called [Snibox](https://github.com/snibox/snibox) to collect snippets of code / programming wisdom as I come through. There's yet another self-hosted software called [Memoet](https://github.com/memoetapp/memoet) which I use to write flash cards about things I want to remember in the longer term. Well, given Snibox doesn't provide a straightforward API and therefore a clever way might be to do some browser scripting. Scripting on the browser and dealing with fresh cookies is something that's possible only on a personal computer where the user is actually logged in - and there's where Nix comes into the picture. To get more clarity on how exactly this is done, you can take a look at this [pull request](https://github.com/rounakdatta/dotfiles/pull/23/files).\n\n## Closing thoughts\n\nThere's no denying of the learning curve of Nix, and one must give enough time test driving before starting to use it in day-to-day work. The reward is in the longer term, as more and more of your workflows are driven by Nix. Eventually, it just fades into the background and *keeps doing its job faithfully*. If you're setting up your Nix dotfiles repository and would need guidance, I'd be happy to help over email!","src/content/notes/alexander-nixinton.md","864e64cf52124f5e",{"html":24,"metadata":25},"\u003Cp>We are at yet another article about \u003Ca href=\"https://nixos.org/\">Nix\u003C/a> - it is a casual attempt to walk you through how it is to use Nix everyday. I also intend to put my two cents into why most people like staying away from it, why a handful are happily sacrificing their weekends over it, and why some blokes are just willing to silently ride the wave. As the homepage says, Nix is both your programming language and the framework. The pitch is that if you’re building and maintaining software for a long-ish term, then you’d like to minimize surprises and keep some old gears rotating as if for ever. Packaging using Nix sorta guarantees that. Yes, and the other niceties like being “declarative” are great, but seemingly many people don’t deeply care about that. Ultimately I’m trying to rant here on how beautiful the Nix ecosystem is, and walk you through the possibilities that could get unlocked.\u003C/p>\n\u003Cp>As a long-time lurker on Nix-related blogposts on HN, I decided to give it a roller-coaster try last year by installing NixOS on my personal laptop. Well, while one can install Nix on an existing Linux/MacOS operating system as an application layer, however that path can be deceptive to shortcuts. I wanted to be true to the declarative and immutability properties of Nix, and therefore chose the hard way.\u003C/p>\n\u003Ch2 id=\"the-first-leap-into-the-valley-of-despair\">The first leap into the valley of despair\u003C/h2>\n\u003Ch3 id=\"brewing-fresh-hot-cutting-edge-nixos-on-my-personal-laptop\">Brewing fresh, hot, cutting (edge) NixOS on my personal laptop\u003C/h3>\n\u003Cp>The enthusiastic journey of installing NixOS (not really unexpectedly) landed into a valley of despair for me. One needs to speak the Nix language, somewhat understand the build process and pick up the right constructs of organizing the setup script - all at the same time. By setup script, we mean the codebase which initially would bootstrap your system, and which ultimately evolves into your all-encompassing dotfiles repository. The core Nix framework is stable, but decisions on whether to choose the new Flake way of packaging or the legacy way of packaging are some decisions that have to be well thought through. Truth to be told, I initially had decided to go with the \u003Ca href=\"https://github.com/hyprwm/Hyprland\">Hyprland\u003C/a> window manager, but that route cost me almost half of a Saturday. Plain, old GNOME (as always) came to my rescue. The lesson is that, while trekking a new, steep mountain, always find that base camp first, and attempt all adventures from there, so that backtrackings are less painful.\u003C/p>\n\u003Cp>At this juncture it is also worth mentioning the project home-manager, which allows you to configure your user directory with a lot of ease. You get to carefully choose which all programs are to be installed at a system level, and which all are to be installed specific to user. Here’s a snippet to describe how elegant it is to configure most of your daily use programs. The \u003Ccode>home\u003C/code> block enclosing signifies that these settings indeed would be specific to a particular user.\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"nix\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">home\u003C/span>\u003Cspan style=\"color:#B31D28;font-style:italic\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  programs\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    htop\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">      enable\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> true\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">      settings\u003C/span>\u003Cspan style=\"color:#24292E\">.\u003C/span>\u003Cspan style=\"color:#6F42C1\">color_scheme\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> 6\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">    };\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    Password-store\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">      enable\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> true\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">    };\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">  };\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">}\u003C/span>\u003Cspan style=\"color:#B31D28;font-style:italic\">;\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>It must be wholeheartedly acknowledged that ChatGPT as well has Phind came very useful throughout the journey - not just helping me in getting familiar with the concepts, but also writing and composing small snippets of Nix programs into however I needed. My current dotfiles repository is essentially an opinionated tapestry of many other repositories handpicked via GitHub Search and the \u003Ca href=\"https://discourse.nixos.org/\">Nix Discourse\u003C/a>.\u003C/p>\n\u003Ch3 id=\"expressing-all-your-logic-and-state-via-nix\">Expressing all your logic and state via Nix\u003C/h3>\n\u003Cp>The promise of Nix just like other infrastructure-as-code frameworks is that you declaratively define what all your need. The framework then takes care of generating the dependency graph, and chalks its way through to creating / modifying the required components as missing. The fact that in NixOS you can rollback to \u003Cem>any\u003C/em> past state (including the Linux kernel) is mindblowing! One also should take a moment to appreciate how vast and wholesome the \u003Ca href=\"https://search.nixos.org/packages\">Nixpkgs\u003C/a> repository is - often you’d be mildly surprised at how the rarest of rare packages has landed up on Nixpkgs (and very often with first-class support for \u003Ccode>aarch64-darwin\u003C/code> i.e. Apple Silicon) - all community contributed!\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># this is how you apply your configuration to a NixOS system\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">nixos-rebuild\u003C/span>\u003Cspan style=\"color:#032F62\"> switch\u003C/span>\u003Cspan style=\"color:#005CC5\"> --flake\u003C/span>\u003Cspan style=\"color:#032F62\"> .\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>The standard pattern of managing dotfiles is to have a repository consisting of them, and then a bootstrapping program like GNU Stow or Ansible bakes them onto the system. This approach invites duplicacy when there are more than one flavours of the underlying system - one can’t possibly embed an if/else logic (across say x86_64 and aarch64) into that innocent dotfile. And this is an area where Nix shines! The configuration (dotfile) and the bootstrapping framework (Nix) are fused into one, so defining logic is very straightforward. Fair to call out here that when you’re “baking” your configuration dotfiles via Nix, they’re immutable and cannot be directly edited. That is, one can’t take a shortcut to modify configurations, and instead should build the entire system every time. A snippet follows to bring the point home:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"nix\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">{ configs\u003C/span>\u003Cspan style=\"color:#D73A49\">,\u003C/span>\u003Cspan style=\"color:#24292E\"> pkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">,\u003C/span>\u003Cspan style=\"color:#D73A49\"> ... \u003C/span>\u003Cspan style=\"color:#24292E\">}:\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#D73A49\">let\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  isDarwin\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#E36209\"> pkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">stdenv\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">isDarwin\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#D73A49\">in\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">{\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  programs\u003C/span>\u003Cspan style=\"color:#24292E\">.\u003C/span>\u003Cspan style=\"color:#6F42C1\">tmux\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    enable\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> true\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    extraConfig\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        set ...\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        # all your over-engineered tmux configs go here\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        set ...\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">    ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#D73A49\">    +\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">    (\u003C/span>\u003Cspan style=\"color:#D73A49\">if\u003C/span>\u003Cspan style=\"color:#E36209\"> isDarwin\u003C/span>\u003Cspan style=\"color:#D73A49\"> then\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        # darwin-specific command to figure out battery details\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        tm_battery=\"♥ #(pmset -g batt)\"\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#D73A49\">    else\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        # linux-specific command to figure out battery details\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">        tm_battery=\"♥ #(acpi --battery)\"\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">    );\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">  }\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#B31D28;font-style:italic\">}\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch3 id=\"the-real-world-isnt-so-declarative-and-not-always-deterministic\">The real world isn’t so declarative and not always deterministic\u003C/h3>\n\u003Cp>While most software configurations are happy to work in a declarative way, you might occasionally come across odd-shaped pieces. Non-declarative patterns are considered \u003Cem>dirty\u003C/em> in Nix, nevertheless it is supported as a concept called \u003Ccode>activations\u003C/code>. One should however keep in mind that operating systems are not declarative inherently, so Nix is doing all the hard work of doing the sequential step and providing a neat declarative abstraction of that to us.\u003C/p>\n\u003Cp>Here’s a small example of what the neat declarative abstraction allows us:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"nix\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">programs\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">gpg\u003C/span>\u003Cspan style=\"color:#B31D28;font-style:italic\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  enable\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> true\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">}\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">services\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">gpg-agent\u003C/span>\u003Cspan style=\"color:#B31D28;font-style:italic\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  enable\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> true\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  pinentryFlavor\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> \"gnome3\"\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  enableSshSupport\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#005CC5\"> true\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">}\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>Having said that, if your requirement is to have sequential steps, you generally achieve that via activations for specific portions something like the following snippet. Make sure to take enough care that the code block is idempotent as it would be run every time yourr configuration gets re-built.\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"nix\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">  home\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">activation\u003C/span>\u003Cspan style=\"color:#B31D28;font-style:italic\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    doomEmacs\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      DOOM=\"$HOME/.emacs.d\"\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      if [ ! -d \"$DOOM\" ]; then\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">          mkdir -p \"$DOOM\"\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      fi\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      cd $DOOM\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      export PATH=\"\u003C/span>\u003Cspan style=\"color:#032F62\">${\u003C/span>\u003Cspan style=\"color:#005CC5\">config\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#005CC5\">home\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#005CC5\">path\u003C/span>\u003Cspan style=\"color:#032F62\">}\u003C/span>\u003Cspan style=\"color:#032F62\">/bin:$PATH\"\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      git init\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      if git remote | grep -q origin; then\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">          git remote set-url origin https://github.com/doomemacs/doomemacs.git\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      else\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">          git remote add origin https://github.com/doomemacs/doomemacs.git\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      fi\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      git fetch origin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      git pull origin master\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">      ...\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">    ''\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">  }\u003C/span>\u003Cspan style=\"color:#B31D28;font-style:italic\">;\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch2 id=\"emerging-victorious-and-onto-the-next---imountains-and-ivalleys\">Emerging victorious and onto the next - iMountains and iValleys\u003C/h2>\n\u003Cp>The months-long experiment with Nix on my personal laptop was a rewarding success, and that called for the next step - \u003Cem>using Nix in production a.k.a at work\u003C/em>. There’s this lovely community-maintained project \u003Ca href=\"https://github.com/LnL7/nix-darwin\">nix-darwin\u003C/a> which allows you to achieve a somewhat similar setup, albeit via the application layer. Unlike NixOS where you could literally rollback upgrades to your kernel and is fool-proof-declarative, on nix-darwin you can manage all your application installations, your configuration dotfiles as well as many macOS settings. Impressively, nix-darwin supports Homebrew as well as mas (Mac Apple Store) application installations. Sure, one can’t configure disk partitions, macOS upgrades and initial manual steps (like logging in to Apple account) using nix-darwin, but that’s a trade-off worth living with.\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># this is how you apply your configuration to a macOS system\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">darwin-rebuild\u003C/span>\u003Cspan style=\"color:#032F62\"> switch\u003C/span>\u003Cspan style=\"color:#005CC5\"> --flake\u003C/span>\u003Cspan style=\"color:#032F62\"> .\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch2 id=\"nixy-science\">Nixy Science\u003C/h2>\n\u003Ch3 id=\"development-environments-and-short-lived-environments\">Development environments and short-lived environments\u003C/h3>\n\u003Cp>Nix development environments (as well as shells) are one of the most impressive things to happen out of the immutability properties of the system. On a single occasion, I needed the Wireshark program for a day or two, and all I had to do was \u003Ccode>nix-shell -p wireshark\u003C/code>. All the user-data produced by that program gets gracefully garbage-collected once you’ve exited that temporary shell. One no longer doesn’t have to deal around with different versions of the JRE, or confusingly-installed global npm packages.\u003C/p>\n\u003Cp>And while nix shells are more for ad-hoc purposes, one can carefully craft Flakes for specific projects which would serve as the development environment template. Flakes can lock in the versions of each package, so they don’t outdate with time. Last year, I attempted \u003Ca href=\"https://adventofcode.com/\">Advent of Code\u003C/a> in OCaml and decided to try out Nix development environments - super impressed!\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"nix\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">{\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  description\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> \"AOC OCaml programming environment presented to you by Nix\"\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  inputs\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    nixpkgs\u003C/span>\u003Cspan style=\"color:#24292E\">.\u003C/span>\u003Cspan style=\"color:#6F42C1\">url\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> \"github:NixOS/nixpkgs/nixos-unstable\"\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">    flake-utils\u003C/span>\u003Cspan style=\"color:#24292E\">.\u003C/span>\u003Cspan style=\"color:#6F42C1\">url\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> \"github:numtide/flake-utils\"\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">  };\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">  outputs\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#24292E\"> { self\u003C/span>\u003Cspan style=\"color:#D73A49\">,\u003C/span>\u003Cspan style=\"color:#24292E\"> nixpkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">,\u003C/span>\u003Cspan style=\"color:#24292E\"> flake-utils\u003C/span>\u003Cspan style=\"color:#D73A49\">,\u003C/span>\u003Cspan style=\"color:#D73A49\"> ... \u003C/span>\u003Cspan style=\"color:#24292E\">}:\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">    flake-utils\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">lib\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">eachDefaultSystem\u003C/span>\u003Cspan style=\"color:#24292E\"> (system:\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#D73A49\">      let\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">        pkgs\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#E36209\"> nixpkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">legacyPackages\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#24292E\">${\u003C/span>\u003Cspan style=\"color:#E36209\">system\u003C/span>\u003Cspan style=\"color:#24292E\">};\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">        ocamlEnv\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#D73A49\"> with\u003C/span>\u003Cspan style=\"color:#E36209\"> pkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">ocamlPackages\u003C/span>\u003Cspan style=\"color:#24292E\">; [\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">          ocaml\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">          utop\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">          dune_3\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">          findlib\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">          ocaml-lsp\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#E36209\">          ocamlformat\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">        ];\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#D73A49\">      in\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">      {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">        devShell\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#E36209\"> pkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">mkShell\u003C/span>\u003Cspan style=\"color:#24292E\"> {\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">          buildInputs\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#E36209\"> ocamlEnv\u003C/span>\u003Cspan style=\"color:#D73A49\"> ++\u003C/span>\u003Cspan style=\"color:#24292E\"> [ \u003C/span>\u003Cspan style=\"color:#E36209\">pkgs\u003C/span>\u003Cspan style=\"color:#D73A49\">.\u003C/span>\u003Cspan style=\"color:#E36209\">opam\u003C/span>\u003Cspan style=\"color:#24292E\"> ];\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">          shellHook\u003C/span>\u003Cspan style=\"color:#D73A49\"> =\u003C/span>\u003Cspan style=\"color:#032F62\"> ''\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            export IN_NIX_DEVELOP_SHELL=1\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            export OPAMROOT=$NIX_BUILD_TOP/.opam\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            # unsetting the below env var is required for fixing a thorny issue with `num` install\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            # similar issue &#x26; solution thread: https://github.com/ocaml/Zarith/issues/136\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            unset OCAMLFIND_DESTDIR\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            opam init --bare --disable-sandboxing -y --shell-setup -vv\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            opam option -global depext=false\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            OCAML_VERSION=$(ocaml --version | awk '{printf $5}')\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            opam switch create $OCAML_VERSION\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            eval $(opam env --switch=$OCAML_VERSION)\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            opam install . --deps-only -y -v\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            # figure out what the default shell of this computer is and set it\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            SHELLY=$(getent passwd $USER | awk -F: '{printf $7}')\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">            exec $SHELLY\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#032F62\">          ''\u003C/span>\u003Cspan style=\"color:#24292E\">;\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">        };\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">      }\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">    );\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#24292E\">}\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch3 id=\"secrets-management\">Secrets management\u003C/h3>\n\u003Cp>This is an area which is still work-in-progress for me. There exists great tooling like \u003Ca href=\"https://github.com/Mic92/sops-nix\">sops-nix\u003C/a>, \u003Ca href=\"https://github.com/yaxitech/ragenix\">agenix\u003C/a> for injecting secret values into your Nix project. Common use cases might be auto-configuring API keys, setting up your private keys at the required paths, bootstrapping local database client and local password store and so on. The best thing about this declarative design is that your secrets would be encrypted and \u003Ca href=\"https://dyne.org/software/tomb/\">tombed\u003C/a> on-device, and you can conveniently commit them to git.\u003C/p>\n\u003Ch3 id=\"endless-automation\">Endless automation\u003C/h3>\n\u003Cp>Nix offers the scope for endless automation - behold your imaginations! You could write simple scripts and then tie them on to \u003Ccode>launchd\u003C/code> / \u003Ccode>systemd\u003C/code> to run them periodically and what not. Writing scheduled scripts on UNIX have existed since forever, but the ability to confidently deploy them using Nix on personal computers is something that’s impressively an emerging capability to me. Nix brings to personal computers what Packer / AWS AMIs brought to server computing.\u003C/p>\n\u003Cp>I have a self-hosted software called \u003Ca href=\"https://github.com/snibox/snibox\">Snibox\u003C/a> to collect snippets of code / programming wisdom as I come through. There’s yet another self-hosted software called \u003Ca href=\"https://github.com/memoetapp/memoet\">Memoet\u003C/a> which I use to write flash cards about things I want to remember in the longer term. Well, given Snibox doesn’t provide a straightforward API and therefore a clever way might be to do some browser scripting. Scripting on the browser and dealing with fresh cookies is something that’s possible only on a personal computer where the user is actually logged in - and there’s where Nix comes into the picture. To get more clarity on how exactly this is done, you can take a look at this \u003Ca href=\"https://github.com/rounakdatta/dotfiles/pull/23/files\">pull request\u003C/a>.\u003C/p>\n\u003Ch2 id=\"closing-thoughts\">Closing thoughts\u003C/h2>\n\u003Cp>There’s no denying of the learning curve of Nix, and one must give enough time test driving before starting to use it in day-to-day work. The reward is in the longer term, as more and more of your workflows are driven by Nix. Eventually, it just fades into the background and \u003Cem>keeps doing its job faithfully\u003C/em>. If you’re setting up your Nix dotfiles repository and would need guidance, I’d be happy to help over email!\u003C/p>",{"headings":26,"localImagePaths":59,"remoteImagePaths":60,"frontmatter":61,"imagePaths":64},[27,31,35,38,41,44,47,50,53,56],{"depth":28,"slug":29,"text":30},2,"the-first-leap-into-the-valley-of-despair","The first leap into the valley of despair",{"depth":32,"slug":33,"text":34},3,"brewing-fresh-hot-cutting-edge-nixos-on-my-personal-laptop","Brewing fresh, hot, cutting (edge) NixOS on my personal laptop",{"depth":32,"slug":36,"text":37},"expressing-all-your-logic-and-state-via-nix","Expressing all your logic and state via Nix",{"depth":32,"slug":39,"text":40},"the-real-world-isnt-so-declarative-and-not-always-deterministic","The real world isn’t so declarative and not always deterministic",{"depth":28,"slug":42,"text":43},"emerging-victorious-and-onto-the-next---imountains-and-ivalleys","Emerging victorious and onto the next - iMountains and iValleys",{"depth":28,"slug":45,"text":46},"nixy-science","Nixy Science",{"depth":32,"slug":48,"text":49},"development-environments-and-short-lived-environments","Development environments and short-lived environments",{"depth":32,"slug":51,"text":52},"secrets-management","Secrets management",{"depth":32,"slug":54,"text":55},"endless-automation","Endless automation",{"depth":28,"slug":57,"text":58},"closing-thoughts","Closing thoughts",[],[],{"title":14,"date":62,"tags":63,"draft":19},["Date","2024-04-19T00:00:00.000Z"],[17,18],[],"firefly",{"id":65,"data":67,"body":73,"filePath":74,"digest":75,"rendered":76},{"title":68,"date":69,"tags":70,"draft":19},"Better managing self-finance with Firefly",["Date","2020-05-25T00:00:00.000Z"],[71,72],"finance","self-hosting","## To what extent do we track our money?\n\nSites and apps are constantly tracking us so closely, with the only intention of knowing us better and presenting us with more self-relatable content (and potentially ads) and engage us even more into the product. We track our shipments, food, health, habits and reasonably quite everything that costs us time. Yeah, of course we do try to keep a sense of our spendings and definitely give a appreciating / regretting thought at the month-end. There being no well-defined \"goods and bads\" of how and where to spend, I believe it's a good practice to always keep our financial data handy and derive inferences from the same as and when required.\n\nOf course [Data Is Beautiful](https://www.reddit.com/r/dataisbeautiful/), but a more beautiful feeling is being command of your monies and not the other way round. Coming directly to the point, I started tracking my spendings for the importantly these reasons:\n\n- Get a clear picture of how much I'm spending in every segment (food / transport / hobbies / bills etc)\n- How much I am worth now (getting to that number really fast) and can I afford that dream X\n- Recalling when I last visited that Y (restaurant / movie / bookstore / Spotify subscription).\n\n## But why wouldn't the bank statement help?\n\nBank transactions are the true trackers of your online spendings, but the data is in silos and not ready for specialized (or I'd say analytical) consumption. And often bank statements (its ~3y for me) lock out older transaction details to be downloaded and processed. Of course we can regularly download those transaction details on a regular basis and maintain an Excel sheet with sophisticated formulas. This is the nerd way of doing it and it surely works like a charm. Yeah, dumping those data into a well-normalized SQL-like datastore would be the next level of it.\n\n## But there are apps for that right?\n\nYes, sure, 21st century makes sure that there's an app for every task you do, making your life convenient; and easy for those in hunt of crowdsourcing data-driven products. We preach that we must own our data and have full controls over it, but deep down we are okay to let someone else use it for a service that pleases you.\n\nWell, financial data is quite sensitive, and it's privacy must not be taken for granted. Needless to repeat here how important it is for us to highly trust a website / app while doing an online transaction through it. And this fact cannot be stressed enough for apps which are deliberately built for this purpose. In India, we have apps like [Walnut](https://www.getwalnut.com/), [ET Money](https://www.etmoney.com/money-manager), [FinArt](https://www.finart.app/) which help you provide with insightful (and definitely beautiful) charts, tables and aggregated figures which helps us make sense of our money better. These are absolutely free to use except the hidden price to pay for is your data. They are tracking each ins and outs from your banks which is in turn helping them improve their **credit score models** and ultimately taking the bank-form (becoming a lending app). The engineering is interesting here on how your spending habits (are the spendings most on the weekend? is it mostly around Koramangala? is it mostly on booze? is it Uber or bus-rides? what's your salary? what's your eat-out temptation? how much rent do you pay?) are enabling them to get a very complete picture of yours (becoming the Google of fintech) and providing you with loans / suggestions according to that. It's hard to believe how much value could it be to all the consumer companies to hold these data (just like how [Aarogya Setu's data's democratization could open up opportunities](https://the-ken.com/story/the-elite-vc-founder-club-riding-aarogya-setu-to-telemed-domination/)).\n\nDid we miss saying that [CRED](https://www.cred.club/), [Jupiter](https://jupiter.money/), [Niyo](https://www.goniyo.com/), [PayZello](https://payzello.com/), [BankOpen](https://www.bankopen.co/) (just to name a few) are all in the game to catch the same fish?\n\nSo, although convenient, maybe it's not quite right.\n\n## TLDR; Introducing Firefly\n\nAnd therefore, here comes the self-help way of doing it - Firefly. As a quick gist, Firefly is an open-source web-based software which abstracts out all the finance managements to simple clicks, yet has a modular, robust architecture backed by databases. The best parts of it are:\n\n- It's open source folks - missing a feature? build it yourself and contribute back! Want your custom extension? build it!\n- You self-host it - and get full control of your data.\n\nFirefly's homepage is \u003Chttps://www.firefly-iii.org/> and the project is mostly maintained by a single man! There has been enormous amount of good discussions on what (and how) Firefly supports and what it doesn't in the documentation as well as in the [GitHub issues](https://github.com/firefly-iii/firefly-iii/issues).\n\nWhen you set up Firefly on your local system or a remote server, you set up a `firefly` database for Firefly to use. It would contain all the normalized tablular data which can be crunched in various forms from an intuitive web user-interface.\n\n1. Provides with neat and exact numbers on bank balances, spends across categories, budgets and more\n2. Displays stunning charts of balance-vs-time for all my bank accounts\n3. Quickly helps me search for when a particular transaction (like say Buying Eggs) happened before\n4. Helps me compare my monthly spendings, and get to why exactly one is greater than another\n5. Well behaves with foreign transactions as well\n6. Doesn't mess up my anxiety by treating a self-transfer (from my bank to my another bank) as an expense\n7. Helps anyone get started with it by import bank statements (downloaded as CSV there) to Firefly in a breeze\n8. It's web-based, means anytime, anywhere on any device!\n9. Helps me set up a partner account to help my dear ones take a glance of the data\n10. Satisfies the developer inside me by providing with an API (automations galore!)\n11. Helps me save up for big and small goals with a well knitted piggy bank system.\n\n![Firefly Dashboard](/images/firefly.png)\n*Sample Firefly Dashboard taken from \u003Chttps://www.firefly-iii.org/#screenshots>*\n\n## My Setup\n\nFirefly is a very lightweight PHP-based application and has been hosted by me on a tiny DigitalOcean instance and has been neatly reverse-proxied through nginx. It's now a practice of mine for every transaction I do to manually put it on Firefly and smile when the bank balance and the Firefly calculation exactly matches.\n\n## What automations could we possibly do?\n\nWell, we could do a lot of automations like making a POST request to Firefly when a Bank SMS is received so that the entire chain of making a transaction -> recording it on Firefly is complete. This part gets more exciting, and a new post awaits that. Until next time!","src/content/notes/firefly.md","9d6a5c32c10f5a5e",{"html":77,"metadata":78},"\u003Ch2 id=\"to-what-extent-do-we-track-our-money\">To what extent do we track our money?\u003C/h2>\n\u003Cp>Sites and apps are constantly tracking us so closely, with the only intention of knowing us better and presenting us with more self-relatable content (and potentially ads) and engage us even more into the product. We track our shipments, food, health, habits and reasonably quite everything that costs us time. Yeah, of course we do try to keep a sense of our spendings and definitely give a appreciating / regretting thought at the month-end. There being no well-defined “goods and bads” of how and where to spend, I believe it’s a good practice to always keep our financial data handy and derive inferences from the same as and when required.\u003C/p>\n\u003Cp>Of course \u003Ca href=\"https://www.reddit.com/r/dataisbeautiful/\">Data Is Beautiful\u003C/a>, but a more beautiful feeling is being command of your monies and not the other way round. Coming directly to the point, I started tracking my spendings for the importantly these reasons:\u003C/p>\n\u003Cul>\n\u003Cli>Get a clear picture of how much I’m spending in every segment (food / transport / hobbies / bills etc)\u003C/li>\n\u003Cli>How much I am worth now (getting to that number really fast) and can I afford that dream X\u003C/li>\n\u003Cli>Recalling when I last visited that Y (restaurant / movie / bookstore / Spotify subscription).\u003C/li>\n\u003C/ul>\n\u003Ch2 id=\"but-why-wouldnt-the-bank-statement-help\">But why wouldn’t the bank statement help?\u003C/h2>\n\u003Cp>Bank transactions are the true trackers of your online spendings, but the data is in silos and not ready for specialized (or I’d say analytical) consumption. And often bank statements (its ~3y for me) lock out older transaction details to be downloaded and processed. Of course we can regularly download those transaction details on a regular basis and maintain an Excel sheet with sophisticated formulas. This is the nerd way of doing it and it surely works like a charm. Yeah, dumping those data into a well-normalized SQL-like datastore would be the next level of it.\u003C/p>\n\u003Ch2 id=\"but-there-are-apps-for-that-right\">But there are apps for that right?\u003C/h2>\n\u003Cp>Yes, sure, 21st century makes sure that there’s an app for every task you do, making your life convenient; and easy for those in hunt of crowdsourcing data-driven products. We preach that we must own our data and have full controls over it, but deep down we are okay to let someone else use it for a service that pleases you.\u003C/p>\n\u003Cp>Well, financial data is quite sensitive, and it’s privacy must not be taken for granted. Needless to repeat here how important it is for us to highly trust a website / app while doing an online transaction through it. And this fact cannot be stressed enough for apps which are deliberately built for this purpose. In India, we have apps like \u003Ca href=\"https://www.getwalnut.com/\">Walnut\u003C/a>, \u003Ca href=\"https://www.etmoney.com/money-manager\">ET Money\u003C/a>, \u003Ca href=\"https://www.finart.app/\">FinArt\u003C/a> which help you provide with insightful (and definitely beautiful) charts, tables and aggregated figures which helps us make sense of our money better. These are absolutely free to use except the hidden price to pay for is your data. They are tracking each ins and outs from your banks which is in turn helping them improve their \u003Cstrong>credit score models\u003C/strong> and ultimately taking the bank-form (becoming a lending app). The engineering is interesting here on how your spending habits (are the spendings most on the weekend? is it mostly around Koramangala? is it mostly on booze? is it Uber or bus-rides? what’s your salary? what’s your eat-out temptation? how much rent do you pay?) are enabling them to get a very complete picture of yours (becoming the Google of fintech) and providing you with loans / suggestions according to that. It’s hard to believe how much value could it be to all the consumer companies to hold these data (just like how \u003Ca href=\"https://the-ken.com/story/the-elite-vc-founder-club-riding-aarogya-setu-to-telemed-domination/\">Aarogya Setu’s data’s democratization could open up opportunities\u003C/a>).\u003C/p>\n\u003Cp>Did we miss saying that \u003Ca href=\"https://www.cred.club/\">CRED\u003C/a>, \u003Ca href=\"https://jupiter.money/\">Jupiter\u003C/a>, \u003Ca href=\"https://www.goniyo.com/\">Niyo\u003C/a>, \u003Ca href=\"https://payzello.com/\">PayZello\u003C/a>, \u003Ca href=\"https://www.bankopen.co/\">BankOpen\u003C/a> (just to name a few) are all in the game to catch the same fish?\u003C/p>\n\u003Cp>So, although convenient, maybe it’s not quite right.\u003C/p>\n\u003Ch2 id=\"tldr-introducing-firefly\">TLDR; Introducing Firefly\u003C/h2>\n\u003Cp>And therefore, here comes the self-help way of doing it - Firefly. As a quick gist, Firefly is an open-source web-based software which abstracts out all the finance managements to simple clicks, yet has a modular, robust architecture backed by databases. The best parts of it are:\u003C/p>\n\u003Cul>\n\u003Cli>It’s open source folks - missing a feature? build it yourself and contribute back! Want your custom extension? build it!\u003C/li>\n\u003Cli>You self-host it - and get full control of your data.\u003C/li>\n\u003C/ul>\n\u003Cp>Firefly’s homepage is \u003Ca href=\"https://www.firefly-iii.org/\">https://www.firefly-iii.org/\u003C/a> and the project is mostly maintained by a single man! There has been enormous amount of good discussions on what (and how) Firefly supports and what it doesn’t in the documentation as well as in the \u003Ca href=\"https://github.com/firefly-iii/firefly-iii/issues\">GitHub issues\u003C/a>.\u003C/p>\n\u003Cp>When you set up Firefly on your local system or a remote server, you set up a \u003Ccode>firefly\u003C/code> database for Firefly to use. It would contain all the normalized tablular data which can be crunched in various forms from an intuitive web user-interface.\u003C/p>\n\u003Col>\n\u003Cli>Provides with neat and exact numbers on bank balances, spends across categories, budgets and more\u003C/li>\n\u003Cli>Displays stunning charts of balance-vs-time for all my bank accounts\u003C/li>\n\u003Cli>Quickly helps me search for when a particular transaction (like say Buying Eggs) happened before\u003C/li>\n\u003Cli>Helps me compare my monthly spendings, and get to why exactly one is greater than another\u003C/li>\n\u003Cli>Well behaves with foreign transactions as well\u003C/li>\n\u003Cli>Doesn’t mess up my anxiety by treating a self-transfer (from my bank to my another bank) as an expense\u003C/li>\n\u003Cli>Helps anyone get started with it by import bank statements (downloaded as CSV there) to Firefly in a breeze\u003C/li>\n\u003Cli>It’s web-based, means anytime, anywhere on any device!\u003C/li>\n\u003Cli>Helps me set up a partner account to help my dear ones take a glance of the data\u003C/li>\n\u003Cli>Satisfies the developer inside me by providing with an API (automations galore!)\u003C/li>\n\u003Cli>Helps me save up for big and small goals with a well knitted piggy bank system.\u003C/li>\n\u003C/ol>\n\u003Cp>\u003Cimg src=\"/images/firefly.png\" alt=\"Firefly Dashboard\">\n\u003Cem>Sample Firefly Dashboard taken from \u003Ca href=\"https://www.firefly-iii.org/#screenshots\">https://www.firefly-iii.org/#screenshots\u003C/a>\u003C/em>\u003C/p>\n\u003Ch2 id=\"my-setup\">My Setup\u003C/h2>\n\u003Cp>Firefly is a very lightweight PHP-based application and has been hosted by me on a tiny DigitalOcean instance and has been neatly reverse-proxied through nginx. It’s now a practice of mine for every transaction I do to manually put it on Firefly and smile when the bank balance and the Firefly calculation exactly matches.\u003C/p>\n\u003Ch2 id=\"what-automations-could-we-possibly-do\">What automations could we possibly do?\u003C/h2>\n\u003Cp>Well, we could do a lot of automations like making a POST request to Firefly when a Bank SMS is received so that the entire chain of making a transaction -> recording it on Firefly is complete. This part gets more exciting, and a new post awaits that. Until next time!\u003C/p>",{"headings":79,"localImagePaths":98,"remoteImagePaths":99,"frontmatter":100,"imagePaths":103},[80,83,86,89,92,95],{"depth":28,"slug":81,"text":82},"to-what-extent-do-we-track-our-money","To what extent do we track our money?",{"depth":28,"slug":84,"text":85},"but-why-wouldnt-the-bank-statement-help","But why wouldn’t the bank statement help?",{"depth":28,"slug":87,"text":88},"but-there-are-apps-for-that-right","But there are apps for that right?",{"depth":28,"slug":90,"text":91},"tldr-introducing-firefly","TLDR; Introducing Firefly",{"depth":28,"slug":93,"text":94},"my-setup","My Setup",{"depth":28,"slug":96,"text":97},"what-automations-could-we-possibly-do","What automations could we possibly do?",[],[],{"title":68,"date":101,"tags":102,"draft":19},["Date","2020-05-25T00:00:00.000Z"],[71,72],[],"himalayan-trek",{"id":104,"data":106,"body":112,"filePath":113,"digest":114,"rendered":115},{"title":107,"date":108,"tags":109,"draft":19},"Dayara Bugyal Himalayan trek with school friends",["Date","2022-09-04T00:00:00.000Z"],[110,111],"travel","friends","My favourite kind of trips are the ones which involve less extravaganza, but are highly memorable and with positive ROI (in any respect). Our 2021 December-end trek was an initialization of that model after a very very long pandemic break. Also this marked as a *true travel* vacation I took almost 1.5 years of working from home due to COVID-19. We, a team of 6 school friends trekked a Himalayan peak; and followed by the same I spent a few days at Delhi to meet new and old friends. The trek was very enjoyable for it was challenging and packed with new, invaluable experiences. The Delhi trip was successful for the fact that it gave me the opportunity to connect with some old college friends, meet up IRL with some new colleagues and spend some happy times with one of our very close family friend. The bonus points of the trip were the subtle facts that it gave me a fresh chance to re-invest into healthy activities, yet another chance to revive (and keep alive) old friendships and discover my country more.\n\nMy writing of this essay fulfils two purposes for me - one to vividly capture the details of the trek (our brains forget the details too soon) and second, a reminder and urge to improve my writing skills. And hopefully a few minutes of cheerful reading for the user! ;)\n\n---\n\n## Day one\n\nOur journey was of course a convergence, but involving divergences before and after. We started on twenty-forth of December 2021 from our homes to unite at Delhi.\n\n- Me, Rohan, Mayank and Lahul travelled from Rishra (my hometown very close to Kolkata) to New Delhi by flight (Mayank had an earlier flight though and hence the first leg of the journey was not together)\n- Agnivo travelled from Hyderabad (where he is currently employed) to New Delhi by flight\n- Shubham travelled from Patna (his hometown) to New Delhi via train\n\nOur team of six needs no introduction except Shubham. Me, Rohan, Mayank, Agnivo and Lahul are school-friends and have been knowing each other since childhood. Shubham (whose nickname is Katty) is a college friend of Rohan who joined us at his interest.\n\n![Excited faces at the CCU airport](/images/airport_selfie.jpg)\n\nWe reached New Delhi on time, and all of us except Katty met outside the airport (Agnivo's flight was quite delayed though). We took an Uber to the spot (**near Kashmere Gate bus stop**) from where we were to catch the bus to Dehradun. Interesting fact to note is that the Uber driver gave us a very pleasurable tour by highlighting various important places in Delhi (of course the ones which fell on the route) and chit-chatting about politics, good and bad things about Delhi. Our sleeper bus was quite late in arrival as well as departure, and that gave us the chance to treat ourselves with bread-omlette and our brought-from-home-tiffins. The bus was not a very comfortable ride, but we got some stress-busting sleep.\n\n## Day two\n\nThe second day had an abrupt start (this is normal from past Chennai-Bangalore bus trips) by having to de-board the buses at destination with sleepy eyes, chilling cold and short notice. A van (which was organized by our guide) took us from the de-board point to the Dehradun ISBT. We had a quick breakfast (toast and omlette) at a local stall followed by cash collection (roads ahead were no-ATM). Interesting to note that *all* the Dehradun roadside stalls were accepting UPI as a payment method. We reached a designated spot where a Bolero car was waiting for us to be picked up. Our rucksacks were loaded on the car roof and we get set go. That was the first time we met Mani - our cook, mule operator and serviceperson (from setting up campfire to presenting breakfast) throughout the trip.\n\nWe were to travel from **Dehradun ISBT** to **Raithal** (a village up the hills) through Uttar Kashi. The car journey was quite a long one (with multiple food breaks, a lot of music and sleepy eyes), but eventful. We met some other fellow travellers who were on the same route like us. The upward (and downward as well) journey proved yet again that mountain drivers have amazing control over the wheel. One thought that had kept us bothered is that our shoes were not yet ready[^1]. A fun fact was that while on lunch stop at Uttar Kashi, we, tired and long-withstanded from bathrooms, were in search of a restaurant which had an attached bathroom so that we could get fresh for the day before lunch. Luckily Hotel HillView Restaurant came to our rescue as well as had a delicious meal for us. So good the food, that we decided to eat at the same place in the return journey as well.\n\n![Stop ft. Maggi break](/images/dehra_dun_to_raithal.jpeg)\n\n![Our favourite hotel at Uttar Kashi (courtesy: Google Images)](/images/hill_view_restaurant_uttarkashi.jpeg)\n\nWe also were able to conclude our shoe confusion at Uttar Kashi - unable to find the recommended Quechua Trek 100 shoes, we settled for ankle-high Snow shoes (locally called Kaplas). The shoes were very uncomfortable on non-snow surfaces, especially on flat cement but we had to have plan C to reject it.\n\n![Stiff ankle and steady body, are you joking!?](/images/snow_boots.jpeg)\n\nWe spent the night at a homestay at Raithal where we met our co-trekkers as well (a group of Bengali professors/teachers). We also met our guide **Chandramohan ji**[^2] The mountains were very aesthetic from the homestay lobby and night was indeed very very chilling. Poor-network days had started from that night.\n\n![Chill, beauty and adventure - all start from here!](/images/raithal_mountains.jpeg)\n\n## Day Trek Starts!\n\n![Crocs and mountains! Of course we do that here ;)](/images/trekking_in_crocs.jpeg)\n\nWe started the day with some light breakfast and mental hotchpotch. Of course I had got my snow trekking boots, they were too difficult to walk with. I set out with Chandramohan ji in search of trekking shoes in the nearby market, but in vain. And there I decided, on the approval and confidence of Chandramohan ji, to trek with Crocs. Walking the stones and boulders and rocks were surprisingly easy with crocs, and that got me great speed. I was actually high on morale, and moderate on bagpack, so I had a great run on the first day. Boulders, edges of mountains, broken trees, high steps - we did it all.\n\n![On mountains, you'd generally keep walking, if its a stop, its a photo-shoot](/images/mountains_day_1.jpeg)\n\n![Broken tree trunks x streams!](/images/trunk_photo_shoot_day_1.jpeg)\n\nWe reached our destination for the day **Neihata**, a grassland valley somewhere in the middle of the Himalayas. The valley was lush green in the afternoon with some patches of snow here and there. The scenery was amazing to enjoy with the tea that was being served. This was going to be the first night (my first experience) we were going to stay in tents and sleep in sleeping bags. What seemed trivial in the afternoon soon became clearly exciting. There was a good amount of snowfall throughout the evening, that not only covered the greenery into snow white, but also dropped the temperature to almost zero. With such shivering cold and sun gone down, we found ourselves keeping closer to each other with torchlights (and headlights), alternating between rubbing our hands for warmth and putting on the woolen gloves. There was also a small fire setup[^3] which became our hub of comfort, socializing and hearing amazing mountain stories. Post torchlit dinner, we spent a great deal of time chatting, laughing with Chandramohan ji and Vinod ji (our adjacent group's guide).\n\n![Snow fell in the evening, and we shivered inside the tents](/images/evening_snowfall_tents.jpeg)\n\n![Guys enjoy snowflakes, afterall they don't wet you that much](/images/snowflakes_dont_wet_you_so_enjoy.jpeg)\n\nMeanwhile I started practising wearing the snow boots while roaming around in the valley. Sleeping bags were a first-time experience for me - they weren't comfortable, and to add to the discomfort, snow accumulated on the edges of the tent making the inner surface very very cold. Tents are generally wind-proof though.\n\n## Day four\n\nOur penultimate stop was **Chilapra**. This was going to be our basecamp for Dayara peak, and our start of return journey. I set out uneasy in the snow boots. The day's journey was overall smooth, we encountered patches of snow, but difficulty was still moderate. There were beautiful peaks and lakes and valleys as we passed through. All we could get from the day were some nice pictures and snow warm-up.\n\n![We unite on the way to Chilapra](/images/on_the_way_to_chilapra.jpeg)\n\n![Rest easy on the lakeside](/images/rest_easy_on_lakeside.jpeg)\n\n![Me, \"candid\"-ing on the lakeside](/images/me_on_frozen_lakeside.jpeg)\n\nThe stop we reached was even colder in terms of temperature, with lowest-felt touching around -9°C. The sky was crystal clear in the night and we had a nice time beside the fire. We saw interesting forms of life like an artificial lake at the spot - which mountaineers have crafted to make water storage and collection easy. We had the peak-climbing next day, and we geared up to that by going to sleep *slightly* early.\n\n## *Day*-ara peak\n\nChandramohan ji had already conveyed us of the trek start time as 7am for the day beforehand thereby plus-plusing the difficulty. One more point to note for the day was that we were to travel light and carry our tiffin boxes along. We of course didn't knew in hindsight that the day's climb would be the toughest of all, and the most satisfying and experience-rich. We arranged and secured our items into a single tent and set out. I was more confident with the shoes now, but the hardest part was yet to come.\n\n![Snow boots are finally at their job!](/images/ankle_deep_snow.jpeg)\n\nThis is the day we started getting ankle-deep snow. The road was long, but very very beautiful. We were walking along the edges of snow-covered mountains unlike the edges along the shrubs-and-rocks. Fresh-snow-filled paths are less risky than molten-snow paths. Again, snow paths are comparatively less riskier than pebble/rocky paths.\n\n![We take photos at the stop-and-see points](/images/halt_for_the_flag.jpeg)\n\n![Snow is all you see](/images/snow_all_along.jpeg)\n\n![Do you want to see some more snow?](/images/some_more_snow.jpeg)\n\n![Should we climb or stop-and-enjoy?](/images/snowy_way_to_dayara_peak.jpeg)\n\nThe ultimate peak-climbing was absolutely enthralling and humbling experience. I, along with my friend Rohan were more tired and were lagging behind. At the last portion, we took a shortcut and chose a more steep route. Chandramohan ji handheld us, and we climbed over the rocks through over 45° elevation. This was an amazing and satisfying experience. We spent some 20-25 mins on the peak, took photos and chilled with the other folks. Needless to say, we had to be very careful at those edges!\n\n![Accomplishment celebration on Dayara peak](/images/peak_done.jpeg)\n\nOur stop post-peak was **Gui** and it was a smooth way from the Dayara peak. We had an intermediate lunch stop, where we consumed our half-spoiled tiffins. Chilled Frooti felt heavenly. By the time we reached Gui, we were extremely tired, and spent a great deal of time lying still on the grasslands. We were wondering how the other teams had the energy to play football :).\n\n## Day six\n\nTrek was at the finish line! Our descent had already begun, and our next stop was Raithal (yes!). We were at high josh, however the thought of again putting on snow boots was slightly an uneasy. I started with wearing those shoes, but after a quarter of the journey I put on my crocs and *Sonic*-ed my way through the mountains post that.\n\n![Wake-up view from our tent, which hotel gives you this ;)](/images/view_from_the_tent.jpeg)\n\n![Meet Vinod ji, our co-trek guide](/images/vinod_ji.jpeg)\n\n![Can you guess what was the joke!?](/images/bright_happy_faces.jpeg)\n\nBefore the journey, we took way too many group photos (including our co-trekkers).\n\n![Our team finishing the trek in style!](/images/trek_group_photo.jpeg)\n\n![Our partner trekkers, a stand-all photo](/images/trek_all_group_photo.jpeg)\n\nI was able to descend very comfortably in crocs. With the *very heavy* snow boots hanging behind me on the sack (and occasionally kicking me), I made my way swiftly chatting with Chandramohan ji about mountains and life. *I truly had a kickass descent.* We even met Mani on the way, the last time in our trek. We also met other fellow trekkers (on the way up, lazily on the way down), came across residents and mountaineers carrying eggs, wood above, mules making their way above clumsily. The last portion of the journey was quite comfortable as well, and we finally were back in the **Raithal** homestay from where we started.\n\nWe got ourselves some food from the local stores (yes, stores are back) and got refreshed. Bathroom availability was once again a thing :). We chatted around, packed our luggages and chilled for the rest of the day. Chandramohan ji and Vinod ji joined us for the evening party.\n\n![Dayara Bugyal trek map (Source: Google Images)](/images/dayara_bugyal_map.jpeg)\n\n[^1]: Our trek plan actually changed due to heavy snowfall. It was initially Har ki dun, but it got diverted to Dayara Bugyal. We had confirmed a shoe rent at Sankri (a stop on the way to Har ki dun) but that plan went haywire at the last moment due to itinerary change. So, we had to figure out a plan B here.\n[^2]: Chandramohan ji is the son of a legendary trekking guide Sulak Ram Rana.\n[^3]: It is generally prohibited by the Forest Department to set up campfires on the mountains. It is a step taken with the surge in number of trekkers in the recent years. When dry woods are burnt at a particular spot, the soil beneath gets burnt (upto few feet) and vegetation can't ever grow on that patch. Hence it is a vigilant and responsible step to avoid campfires.","src/content/notes/himalayan-trek.md","7d7c39e72580989a",{"html":116,"metadata":117},"\u003Cp>My favourite kind of trips are the ones which involve less extravaganza, but are highly memorable and with positive ROI (in any respect). Our 2021 December-end trek was an initialization of that model after a very very long pandemic break. Also this marked as a \u003Cem>true travel\u003C/em> vacation I took almost 1.5 years of working from home due to COVID-19. We, a team of 6 school friends trekked a Himalayan peak; and followed by the same I spent a few days at Delhi to meet new and old friends. The trek was very enjoyable for it was challenging and packed with new, invaluable experiences. The Delhi trip was successful for the fact that it gave me the opportunity to connect with some old college friends, meet up IRL with some new colleagues and spend some happy times with one of our very close family friend. The bonus points of the trip were the subtle facts that it gave me a fresh chance to re-invest into healthy activities, yet another chance to revive (and keep alive) old friendships and discover my country more.\u003C/p>\n\u003Cp>My writing of this essay fulfils two purposes for me - one to vividly capture the details of the trek (our brains forget the details too soon) and second, a reminder and urge to improve my writing skills. And hopefully a few minutes of cheerful reading for the user! ;)\u003C/p>\n\u003Chr>\n\u003Ch2 id=\"day-one\">Day one\u003C/h2>\n\u003Cp>Our journey was of course a convergence, but involving divergences before and after. We started on twenty-forth of December 2021 from our homes to unite at Delhi.\u003C/p>\n\u003Cul>\n\u003Cli>Me, Rohan, Mayank and Lahul travelled from Rishra (my hometown very close to Kolkata) to New Delhi by flight (Mayank had an earlier flight though and hence the first leg of the journey was not together)\u003C/li>\n\u003Cli>Agnivo travelled from Hyderabad (where he is currently employed) to New Delhi by flight\u003C/li>\n\u003Cli>Shubham travelled from Patna (his hometown) to New Delhi via train\u003C/li>\n\u003C/ul>\n\u003Cp>Our team of six needs no introduction except Shubham. Me, Rohan, Mayank, Agnivo and Lahul are school-friends and have been knowing each other since childhood. Shubham (whose nickname is Katty) is a college friend of Rohan who joined us at his interest.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/airport_selfie.jpg\" alt=\"Excited faces at the CCU airport\">\u003C/p>\n\u003Cp>We reached New Delhi on time, and all of us except Katty met outside the airport (Agnivo’s flight was quite delayed though). We took an Uber to the spot (\u003Cstrong>near Kashmere Gate bus stop\u003C/strong>) from where we were to catch the bus to Dehradun. Interesting fact to note is that the Uber driver gave us a very pleasurable tour by highlighting various important places in Delhi (of course the ones which fell on the route) and chit-chatting about politics, good and bad things about Delhi. Our sleeper bus was quite late in arrival as well as departure, and that gave us the chance to treat ourselves with bread-omlette and our brought-from-home-tiffins. The bus was not a very comfortable ride, but we got some stress-busting sleep.\u003C/p>\n\u003Ch2 id=\"day-two\">Day two\u003C/h2>\n\u003Cp>The second day had an abrupt start (this is normal from past Chennai-Bangalore bus trips) by having to de-board the buses at destination with sleepy eyes, chilling cold and short notice. A van (which was organized by our guide) took us from the de-board point to the Dehradun ISBT. We had a quick breakfast (toast and omlette) at a local stall followed by cash collection (roads ahead were no-ATM). Interesting to note that \u003Cem>all\u003C/em> the Dehradun roadside stalls were accepting UPI as a payment method. We reached a designated spot where a Bolero car was waiting for us to be picked up. Our rucksacks were loaded on the car roof and we get set go. That was the first time we met Mani - our cook, mule operator and serviceperson (from setting up campfire to presenting breakfast) throughout the trip.\u003C/p>\n\u003Cp>We were to travel from \u003Cstrong>Dehradun ISBT\u003C/strong> to \u003Cstrong>Raithal\u003C/strong> (a village up the hills) through Uttar Kashi. The car journey was quite a long one (with multiple food breaks, a lot of music and sleepy eyes), but eventful. We met some other fellow travellers who were on the same route like us. The upward (and downward as well) journey proved yet again that mountain drivers have amazing control over the wheel. One thought that had kept us bothered is that our shoes were not yet ready\u003Csup>\u003Ca href=\"#user-content-fn-1\" id=\"user-content-fnref-1\" data-footnote-ref=\"\" aria-describedby=\"footnote-label\">1\u003C/a>\u003C/sup>. A fun fact was that while on lunch stop at Uttar Kashi, we, tired and long-withstanded from bathrooms, were in search of a restaurant which had an attached bathroom so that we could get fresh for the day before lunch. Luckily Hotel HillView Restaurant came to our rescue as well as had a delicious meal for us. So good the food, that we decided to eat at the same place in the return journey as well.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/dehra_dun_to_raithal.jpeg\" alt=\"Stop ft. Maggi break\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/hill_view_restaurant_uttarkashi.jpeg\" alt=\"Our favourite hotel at Uttar Kashi (courtesy: Google Images)\">\u003C/p>\n\u003Cp>We also were able to conclude our shoe confusion at Uttar Kashi - unable to find the recommended Quechua Trek 100 shoes, we settled for ankle-high Snow shoes (locally called Kaplas). The shoes were very uncomfortable on non-snow surfaces, especially on flat cement but we had to have plan C to reject it.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/snow_boots.jpeg\" alt=\"Stiff ankle and steady body, are you joking!?\">\u003C/p>\n\u003Cp>We spent the night at a homestay at Raithal where we met our co-trekkers as well (a group of Bengali professors/teachers). We also met our guide \u003Cstrong>Chandramohan ji\u003C/strong>\u003Csup>\u003Ca href=\"#user-content-fn-2\" id=\"user-content-fnref-2\" data-footnote-ref=\"\" aria-describedby=\"footnote-label\">2\u003C/a>\u003C/sup> The mountains were very aesthetic from the homestay lobby and night was indeed very very chilling. Poor-network days had started from that night.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/raithal_mountains.jpeg\" alt=\"Chill, beauty and adventure - all start from here!\">\u003C/p>\n\u003Ch2 id=\"day-trek-starts\">Day Trek Starts!\u003C/h2>\n\u003Cp>\u003Cimg src=\"/images/trekking_in_crocs.jpeg\" alt=\"Crocs and mountains! Of course we do that here ;)\">\u003C/p>\n\u003Cp>We started the day with some light breakfast and mental hotchpotch. Of course I had got my snow trekking boots, they were too difficult to walk with. I set out with Chandramohan ji in search of trekking shoes in the nearby market, but in vain. And there I decided, on the approval and confidence of Chandramohan ji, to trek with Crocs. Walking the stones and boulders and rocks were surprisingly easy with crocs, and that got me great speed. I was actually high on morale, and moderate on bagpack, so I had a great run on the first day. Boulders, edges of mountains, broken trees, high steps - we did it all.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/mountains_day_1.jpeg\" alt=\"On mountains, you&#x27;d generally keep walking, if its a stop, its a photo-shoot\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/trunk_photo_shoot_day_1.jpeg\" alt=\"Broken tree trunks x streams!\">\u003C/p>\n\u003Cp>We reached our destination for the day \u003Cstrong>Neihata\u003C/strong>, a grassland valley somewhere in the middle of the Himalayas. The valley was lush green in the afternoon with some patches of snow here and there. The scenery was amazing to enjoy with the tea that was being served. This was going to be the first night (my first experience) we were going to stay in tents and sleep in sleeping bags. What seemed trivial in the afternoon soon became clearly exciting. There was a good amount of snowfall throughout the evening, that not only covered the greenery into snow white, but also dropped the temperature to almost zero. With such shivering cold and sun gone down, we found ourselves keeping closer to each other with torchlights (and headlights), alternating between rubbing our hands for warmth and putting on the woolen gloves. There was also a small fire setup\u003Csup>\u003Ca href=\"#user-content-fn-3\" id=\"user-content-fnref-3\" data-footnote-ref=\"\" aria-describedby=\"footnote-label\">3\u003C/a>\u003C/sup> which became our hub of comfort, socializing and hearing amazing mountain stories. Post torchlit dinner, we spent a great deal of time chatting, laughing with Chandramohan ji and Vinod ji (our adjacent group’s guide).\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/evening_snowfall_tents.jpeg\" alt=\"Snow fell in the evening, and we shivered inside the tents\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/snowflakes_dont_wet_you_so_enjoy.jpeg\" alt=\"Guys enjoy snowflakes, afterall they don&#x27;t wet you that much\">\u003C/p>\n\u003Cp>Meanwhile I started practising wearing the snow boots while roaming around in the valley. Sleeping bags were a first-time experience for me - they weren’t comfortable, and to add to the discomfort, snow accumulated on the edges of the tent making the inner surface very very cold. Tents are generally wind-proof though.\u003C/p>\n\u003Ch2 id=\"day-four\">Day four\u003C/h2>\n\u003Cp>Our penultimate stop was \u003Cstrong>Chilapra\u003C/strong>. This was going to be our basecamp for Dayara peak, and our start of return journey. I set out uneasy in the snow boots. The day’s journey was overall smooth, we encountered patches of snow, but difficulty was still moderate. There were beautiful peaks and lakes and valleys as we passed through. All we could get from the day were some nice pictures and snow warm-up.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/on_the_way_to_chilapra.jpeg\" alt=\"We unite on the way to Chilapra\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/rest_easy_on_lakeside.jpeg\" alt=\"Rest easy on the lakeside\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/me_on_frozen_lakeside.jpeg\" alt=\"Me, &#x22;candid&#x22;-ing on the lakeside\">\u003C/p>\n\u003Cp>The stop we reached was even colder in terms of temperature, with lowest-felt touching around -9°C. The sky was crystal clear in the night and we had a nice time beside the fire. We saw interesting forms of life like an artificial lake at the spot - which mountaineers have crafted to make water storage and collection easy. We had the peak-climbing next day, and we geared up to that by going to sleep \u003Cem>slightly\u003C/em> early.\u003C/p>\n\u003Ch2 id=\"day-ara-peak\">\u003Cem>Day\u003C/em>-ara peak\u003C/h2>\n\u003Cp>Chandramohan ji had already conveyed us of the trek start time as 7am for the day beforehand thereby plus-plusing the difficulty. One more point to note for the day was that we were to travel light and carry our tiffin boxes along. We of course didn’t knew in hindsight that the day’s climb would be the toughest of all, and the most satisfying and experience-rich. We arranged and secured our items into a single tent and set out. I was more confident with the shoes now, but the hardest part was yet to come.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/ankle_deep_snow.jpeg\" alt=\"Snow boots are finally at their job!\">\u003C/p>\n\u003Cp>This is the day we started getting ankle-deep snow. The road was long, but very very beautiful. We were walking along the edges of snow-covered mountains unlike the edges along the shrubs-and-rocks. Fresh-snow-filled paths are less risky than molten-snow paths. Again, snow paths are comparatively less riskier than pebble/rocky paths.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/halt_for_the_flag.jpeg\" alt=\"We take photos at the stop-and-see points\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/snow_all_along.jpeg\" alt=\"Snow is all you see\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/some_more_snow.jpeg\" alt=\"Do you want to see some more snow?\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/snowy_way_to_dayara_peak.jpeg\" alt=\"Should we climb or stop-and-enjoy?\">\u003C/p>\n\u003Cp>The ultimate peak-climbing was absolutely enthralling and humbling experience. I, along with my friend Rohan were more tired and were lagging behind. At the last portion, we took a shortcut and chose a more steep route. Chandramohan ji handheld us, and we climbed over the rocks through over 45° elevation. This was an amazing and satisfying experience. We spent some 20-25 mins on the peak, took photos and chilled with the other folks. Needless to say, we had to be very careful at those edges!\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/peak_done.jpeg\" alt=\"Accomplishment celebration on Dayara peak\">\u003C/p>\n\u003Cp>Our stop post-peak was \u003Cstrong>Gui\u003C/strong> and it was a smooth way from the Dayara peak. We had an intermediate lunch stop, where we consumed our half-spoiled tiffins. Chilled Frooti felt heavenly. By the time we reached Gui, we were extremely tired, and spent a great deal of time lying still on the grasslands. We were wondering how the other teams had the energy to play football :).\u003C/p>\n\u003Ch2 id=\"day-six\">Day six\u003C/h2>\n\u003Cp>Trek was at the finish line! Our descent had already begun, and our next stop was Raithal (yes!). We were at high josh, however the thought of again putting on snow boots was slightly an uneasy. I started with wearing those shoes, but after a quarter of the journey I put on my crocs and \u003Cem>Sonic\u003C/em>-ed my way through the mountains post that.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/view_from_the_tent.jpeg\" alt=\"Wake-up view from our tent, which hotel gives you this ;)\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/vinod_ji.jpeg\" alt=\"Meet Vinod ji, our co-trek guide\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/bright_happy_faces.jpeg\" alt=\"Can you guess what was the joke!?\">\u003C/p>\n\u003Cp>Before the journey, we took way too many group photos (including our co-trekkers).\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/trek_group_photo.jpeg\" alt=\"Our team finishing the trek in style!\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/trek_all_group_photo.jpeg\" alt=\"Our partner trekkers, a stand-all photo\">\u003C/p>\n\u003Cp>I was able to descend very comfortably in crocs. With the \u003Cem>very heavy\u003C/em> snow boots hanging behind me on the sack (and occasionally kicking me), I made my way swiftly chatting with Chandramohan ji about mountains and life. \u003Cem>I truly had a kickass descent.\u003C/em> We even met Mani on the way, the last time in our trek. We also met other fellow trekkers (on the way up, lazily on the way down), came across residents and mountaineers carrying eggs, wood above, mules making their way above clumsily. The last portion of the journey was quite comfortable as well, and we finally were back in the \u003Cstrong>Raithal\u003C/strong> homestay from where we started.\u003C/p>\n\u003Cp>We got ourselves some food from the local stores (yes, stores are back) and got refreshed. Bathroom availability was once again a thing :). We chatted around, packed our luggages and chilled for the rest of the day. Chandramohan ji and Vinod ji joined us for the evening party.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/dayara_bugyal_map.jpeg\" alt=\"Dayara Bugyal trek map (Source: Google Images)\">\u003C/p>\n\u003Csection data-footnotes=\"\" class=\"footnotes\">\u003Ch2 class=\"sr-only\" id=\"footnote-label\">Footnotes\u003C/h2>\n\u003Col>\n\u003Cli id=\"user-content-fn-1\">\n\u003Cp>Our trek plan actually changed due to heavy snowfall. It was initially Har ki dun, but it got diverted to Dayara Bugyal. We had confirmed a shoe rent at Sankri (a stop on the way to Har ki dun) but that plan went haywire at the last moment due to itinerary change. So, we had to figure out a plan B here. \u003Ca href=\"#user-content-fnref-1\" data-footnote-backref=\"\" aria-label=\"Back to reference 1\" class=\"data-footnote-backref\">↩\u003C/a>\u003C/p>\n\u003C/li>\n\u003Cli id=\"user-content-fn-2\">\n\u003Cp>Chandramohan ji is the son of a legendary trekking guide Sulak Ram Rana. \u003Ca href=\"#user-content-fnref-2\" data-footnote-backref=\"\" aria-label=\"Back to reference 2\" class=\"data-footnote-backref\">↩\u003C/a>\u003C/p>\n\u003C/li>\n\u003Cli id=\"user-content-fn-3\">\n\u003Cp>It is generally prohibited by the Forest Department to set up campfires on the mountains. It is a step taken with the surge in number of trekkers in the recent years. When dry woods are burnt at a particular spot, the soil beneath gets burnt (upto few feet) and vegetation can’t ever grow on that patch. Hence it is a vigilant and responsible step to avoid campfires. \u003Ca href=\"#user-content-fnref-3\" data-footnote-backref=\"\" aria-label=\"Back to reference 3\" class=\"data-footnote-backref\">↩\u003C/a>\u003C/p>\n\u003C/li>\n\u003C/ol>\n\u003C/section>",{"headings":118,"localImagePaths":140,"remoteImagePaths":141,"frontmatter":142,"imagePaths":145},[119,122,125,128,131,134,137],{"depth":28,"slug":120,"text":121},"day-one","Day one",{"depth":28,"slug":123,"text":124},"day-two","Day two",{"depth":28,"slug":126,"text":127},"day-trek-starts","Day Trek Starts!",{"depth":28,"slug":129,"text":130},"day-four","Day four",{"depth":28,"slug":132,"text":133},"day-ara-peak","Day-ara peak",{"depth":28,"slug":135,"text":136},"day-six","Day six",{"depth":28,"slug":138,"text":139},"footnote-label","Footnotes",[],[],{"title":107,"date":143,"tags":144,"draft":19},["Date","2022-09-04T00:00:00.000Z"],[110,111],[],"godfs",{"id":146,"data":148,"body":154,"filePath":155,"digest":156,"rendered":157},{"title":149,"date":150,"tags":151,"draft":19},"GoDFS - a simple Distributed FileSystem written in Go",["Date","2020-08-09T00:00:00.000Z"],[152,153],"golang","distributed-systems","> Redundancy is the key in software engineering ~Paul Klint\n\nI've been midway through [Designing Data-Intensive Applications](https://www.goodreads.com/book/show/23463279-designing-data-intensive-applications) and implementing such a distributed system and its algorithms was always on my stack. This implementation tries to cover most of the important aspects, yet largely simplified.\n\nThe source for this project is [rounakdatta/GoDFS](https://github.com/rounakdatta/GoDFS).\n\n## Building Go Distributed File System\n\n### Abstracting away the odds\n\nProven systems like [Google FileSystem (GFS)](https://static.googleusercontent.com/media/research.google.com/en//archive/gfs-sosp2003.pdf) and [Hadoop Distributed FileSystem](https://hadoop.apache.org/docs/r1.2.1/hdfs_design.pdf) have almost made developers take distributed architectures for granted. We now regularly use open-source systems like the Hadoop ecosystem tools, managed cloud services without worrying of the underlying engineering behind scaling it across machines, data-centers and continents. In this implementation as well, we have abstracted the working of RPC, filesystem storage considerations, thus making it not production-ready ;)\n\n![DynamoDB Rant](/images/dynamodb_rant.png)\n*[Source](https://www.jeremydaly.com/takeaways-from-dynamodb-deep-dive-advanced-design-patterns-dat403/)*\n\n### The pieces\n\nTo build a distributed system which stores and serves files on-demand typically needs to have a set of persistent data stores, a coordinating unit and an user-facing dumb client.\n\n#### DataNode\n\nDataNodes in this system are just holding the data and when provided with an address can write data to or read data from that address. The data nodes deal with chunks of data which when aggregated by someone else makes sense. Ideally, the number of data nodes should be greater than one for it to be a distributed system. Also it is not necessary that a single data node would contain every chunk of a particular file.\n\n#### NameNode\n\nThe NameNode is ideally a singular central coordinating unit of the entire system. It's responsibilities start from record-keeping of which all data nodes are available/healthy and helping the client decide with where all to put the chunks for an incoming file & where all to fetch the chunks from for a requested file. The name node also knows what is the chunk size (termed BlockSize later) and how many copies of data to keep (ReplicationFactor). The name node is the know-it-all guy of the system and therefore making it's death fatal for the system. Therefore we must have a backup name node (called Secondary NameNode) to which the NameNode is flushing all its meta periodically.\n\n#### Client\n\nClient does all the talking. Upon the client getting a request from the user interface, it's job is to first contact the NameNode for all the meta information. If it is a file `PUT` request, name node helps it by providing where all to keep the chunks in (the endpoints of the DataNodes and the target directory path within them). If it is a file `GET` request, the name node helps it by providing the intrinsic details of where exactly to obtain the chunks from. And thus the loop completes.\n\n### The chunks\n\nWe must decide on a BlockSize factor which determines into how many pieces a file is broken into. Of course having this metric too high or low impacts the write and read performances of the system overall, but we need to find a justified value which has been benchmarked. The chunks (henceforth referred to as blocks) are stored as individual files and is indexed by the NameNode through a BlockId. Depending upon ReplicationFactor we might have redundant copies of the same block stored on multiple data nodes.\n\n### The replication\n\nReplication is probably the most important factor in this context. We must decide upon the ReplicationFactor considering the cost-reliability trade-off. The replication in this system works as: When the client requests a particular DataNode to write a new block into its file system, the client also supplies with which all data nodes to replicate to. Now as the first data node finishes writing to its own file system, it itself connects to the next replication candidate data node and passes the remaining array of replication candidates. And thus the replication process finishes when the tail of the recursion returns to the client and the replicated file write can be concluded to have succeeded.\n\n### The talking\n\nAs the client communicates with the NameNode, DataNodes, as the DataNodes whisper to each other, what is the protocol of talking? We are using plain and simple RPC (Remote Procedural Calls) here in this case.\n\n## Setting it up\n\nYou can try GoDFS manually or by setting it up through Docker Compose. We can test and compile it to produce a binary as:\n\n```shell\nmake test\nmake build\n```\n\n### Natively on local host\n\nFirst, we need to set up the DataNode and NameNode daemons, we are starting 3 data nodes for example, and they are running on the same host:\n\n```shell\n./godfs datanode --port 7000 --data-location .dndata1/\n./godfs datanode --port 7001 --data-location .dndata2/\n./godfs datanode --port 7002 --data-location .dndata3/\n```\n\nNext, we are initializing the NameNode providing it with the list of data nodes available. If not provided explicitly, the NameNode tries discovering services in the local host for a particular range of ports.\n\n```shell\n./godfs namenode --datanodes localhost:7000,localhost:7001,localhost:7002 --block-size 10 --replication-factor 2\n```\n\nNow, we are good to try using the client to do the file keeping and fetching operations (let's try with the readme file):\n\n```shell\n./godfs client --namenode localhost:9000 --operation put --source-path ./ --filename README.md\n# 2020/08/08 18:08:51 NameNode to connect to is localhost:9000\n# 2020/08/08 18:08:52 Put status: true\n\n./godfs client --namenode localhost:9000 --operation get --filename README.md\n# 2020/08/08 18:09:00 NameNode to connect to is localhost:9000\n# 2020/08/08 18:09:00 Get status: true\n# FILE CONTENTS ...\n```\n\n### Containerized through Docker Compose\n\nIn the `docker-compose.yml` file, we try to define the DataNode and NameNode as independent services and the requested number of instances of the same will be spawned up. We have individual `Dockerfile`s for the DataNode and NameNode.\n\nAssuming we have Docker set up in the host system, we have to build the images first:\n\n```shell\ndocker build -t datanode -f daemon/datanode/Dockerfile .\ndocker build -t namenode -f daemon/namenode/Dockerfile .\ndocker build -t client -f daemon/client/Dockerfile .\n```\n\nNow we can initiate a desired number of containers for DataNode and a single container for NameNode as:\n\n```shell\ndocker-compose up --scale datanode=6 --remove-orphans --force-recreate\n```\n\nNext, we would need a client in the same network to test out requests:\n\n```shell\ndocker run -it --network host client\n```\n\n> TODO: Here we have allowed the DataNode containers to run within the **host** network, i.e. its processes are now exposed to the host. We need some more sophistication in the isolation here.\n\nEither way of testing, to test the end-to-end working of the system, we not only want `GET` Success, but also want to understand when such a DFS can fail. We can fetch the metadata from the NameNode on where all the blocks of a given file are kept. So, theoretically, if `replication-factor` is 2 and we identify those 2 DataNodes for a particular file BlockId, we can then experiment with the edge cases of distributed systems by killing those two containers. And then we should no longer be able to fetch the complete file (since a part of it does not exist in any of the data nodes). If practice matches the above theory, we are good to go :)!","src/content/notes/godfs.md","2280f44e6412da05",{"html":158,"metadata":159},"\u003Cblockquote>\n\u003Cp>Redundancy is the key in software engineering ~Paul Klint\u003C/p>\n\u003C/blockquote>\n\u003Cp>I’ve been midway through \u003Ca href=\"https://www.goodreads.com/book/show/23463279-designing-data-intensive-applications\">Designing Data-Intensive Applications\u003C/a> and implementing such a distributed system and its algorithms was always on my stack. This implementation tries to cover most of the important aspects, yet largely simplified.\u003C/p>\n\u003Cp>The source for this project is \u003Ca href=\"https://github.com/rounakdatta/GoDFS\">rounakdatta/GoDFS\u003C/a>.\u003C/p>\n\u003Ch2 id=\"building-go-distributed-file-system\">Building Go Distributed File System\u003C/h2>\n\u003Ch3 id=\"abstracting-away-the-odds\">Abstracting away the odds\u003C/h3>\n\u003Cp>Proven systems like \u003Ca href=\"https://static.googleusercontent.com/media/research.google.com/en//archive/gfs-sosp2003.pdf\">Google FileSystem (GFS)\u003C/a> and \u003Ca href=\"https://hadoop.apache.org/docs/r1.2.1/hdfs_design.pdf\">Hadoop Distributed FileSystem\u003C/a> have almost made developers take distributed architectures for granted. We now regularly use open-source systems like the Hadoop ecosystem tools, managed cloud services without worrying of the underlying engineering behind scaling it across machines, data-centers and continents. In this implementation as well, we have abstracted the working of RPC, filesystem storage considerations, thus making it not production-ready ;)\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/dynamodb_rant.png\" alt=\"DynamoDB Rant\">\n\u003Cem>\u003Ca href=\"https://www.jeremydaly.com/takeaways-from-dynamodb-deep-dive-advanced-design-patterns-dat403/\">Source\u003C/a>\u003C/em>\u003C/p>\n\u003Ch3 id=\"the-pieces\">The pieces\u003C/h3>\n\u003Cp>To build a distributed system which stores and serves files on-demand typically needs to have a set of persistent data stores, a coordinating unit and an user-facing dumb client.\u003C/p>\n\u003Ch4 id=\"datanode\">DataNode\u003C/h4>\n\u003Cp>DataNodes in this system are just holding the data and when provided with an address can write data to or read data from that address. The data nodes deal with chunks of data which when aggregated by someone else makes sense. Ideally, the number of data nodes should be greater than one for it to be a distributed system. Also it is not necessary that a single data node would contain every chunk of a particular file.\u003C/p>\n\u003Ch4 id=\"namenode\">NameNode\u003C/h4>\n\u003Cp>The NameNode is ideally a singular central coordinating unit of the entire system. It’s responsibilities start from record-keeping of which all data nodes are available/healthy and helping the client decide with where all to put the chunks for an incoming file &#x26; where all to fetch the chunks from for a requested file. The name node also knows what is the chunk size (termed BlockSize later) and how many copies of data to keep (ReplicationFactor). The name node is the know-it-all guy of the system and therefore making it’s death fatal for the system. Therefore we must have a backup name node (called Secondary NameNode) to which the NameNode is flushing all its meta periodically.\u003C/p>\n\u003Ch4 id=\"client\">Client\u003C/h4>\n\u003Cp>Client does all the talking. Upon the client getting a request from the user interface, it’s job is to first contact the NameNode for all the meta information. If it is a file \u003Ccode>PUT\u003C/code> request, name node helps it by providing where all to keep the chunks in (the endpoints of the DataNodes and the target directory path within them). If it is a file \u003Ccode>GET\u003C/code> request, the name node helps it by providing the intrinsic details of where exactly to obtain the chunks from. And thus the loop completes.\u003C/p>\n\u003Ch3 id=\"the-chunks\">The chunks\u003C/h3>\n\u003Cp>We must decide on a BlockSize factor which determines into how many pieces a file is broken into. Of course having this metric too high or low impacts the write and read performances of the system overall, but we need to find a justified value which has been benchmarked. The chunks (henceforth referred to as blocks) are stored as individual files and is indexed by the NameNode through a BlockId. Depending upon ReplicationFactor we might have redundant copies of the same block stored on multiple data nodes.\u003C/p>\n\u003Ch3 id=\"the-replication\">The replication\u003C/h3>\n\u003Cp>Replication is probably the most important factor in this context. We must decide upon the ReplicationFactor considering the cost-reliability trade-off. The replication in this system works as: When the client requests a particular DataNode to write a new block into its file system, the client also supplies with which all data nodes to replicate to. Now as the first data node finishes writing to its own file system, it itself connects to the next replication candidate data node and passes the remaining array of replication candidates. And thus the replication process finishes when the tail of the recursion returns to the client and the replicated file write can be concluded to have succeeded.\u003C/p>\n\u003Ch3 id=\"the-talking\">The talking\u003C/h3>\n\u003Cp>As the client communicates with the NameNode, DataNodes, as the DataNodes whisper to each other, what is the protocol of talking? We are using plain and simple RPC (Remote Procedural Calls) here in this case.\u003C/p>\n\u003Ch2 id=\"setting-it-up\">Setting it up\u003C/h2>\n\u003Cp>You can try GoDFS manually or by setting it up through Docker Compose. We can test and compile it to produce a binary as:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">make\u003C/span>\u003Cspan style=\"color:#032F62\"> test\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">make\u003C/span>\u003Cspan style=\"color:#032F62\"> build\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch3 id=\"natively-on-local-host\">Natively on local host\u003C/h3>\n\u003Cp>First, we need to set up the DataNode and NameNode daemons, we are starting 3 data nodes for example, and they are running on the same host:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">./godfs\u003C/span>\u003Cspan style=\"color:#032F62\"> datanode\u003C/span>\u003Cspan style=\"color:#005CC5\"> --port\u003C/span>\u003Cspan style=\"color:#005CC5\"> 7000\u003C/span>\u003Cspan style=\"color:#005CC5\"> --data-location\u003C/span>\u003Cspan style=\"color:#032F62\"> .dndata1/\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">./godfs\u003C/span>\u003Cspan style=\"color:#032F62\"> datanode\u003C/span>\u003Cspan style=\"color:#005CC5\"> --port\u003C/span>\u003Cspan style=\"color:#005CC5\"> 7001\u003C/span>\u003Cspan style=\"color:#005CC5\"> --data-location\u003C/span>\u003Cspan style=\"color:#032F62\"> .dndata2/\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">./godfs\u003C/span>\u003Cspan style=\"color:#032F62\"> datanode\u003C/span>\u003Cspan style=\"color:#005CC5\"> --port\u003C/span>\u003Cspan style=\"color:#005CC5\"> 7002\u003C/span>\u003Cspan style=\"color:#005CC5\"> --data-location\u003C/span>\u003Cspan style=\"color:#032F62\"> .dndata3/\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>Next, we are initializing the NameNode providing it with the list of data nodes available. If not provided explicitly, the NameNode tries discovering services in the local host for a particular range of ports.\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">./godfs\u003C/span>\u003Cspan style=\"color:#032F62\"> namenode\u003C/span>\u003Cspan style=\"color:#005CC5\"> --datanodes\u003C/span>\u003Cspan style=\"color:#032F62\"> localhost:7000,localhost:7001,localhost:7002\u003C/span>\u003Cspan style=\"color:#005CC5\"> --block-size\u003C/span>\u003Cspan style=\"color:#005CC5\"> 10\u003C/span>\u003Cspan style=\"color:#005CC5\"> --replication-factor\u003C/span>\u003Cspan style=\"color:#005CC5\"> 2\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>Now, we are good to try using the client to do the file keeping and fetching operations (let’s try with the readme file):\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">./godfs\u003C/span>\u003Cspan style=\"color:#032F62\"> client\u003C/span>\u003Cspan style=\"color:#005CC5\"> --namenode\u003C/span>\u003Cspan style=\"color:#032F62\"> localhost:9000\u003C/span>\u003Cspan style=\"color:#005CC5\"> --operation\u003C/span>\u003Cspan style=\"color:#032F62\"> put\u003C/span>\u003Cspan style=\"color:#005CC5\"> --source-path\u003C/span>\u003Cspan style=\"color:#032F62\"> ./\u003C/span>\u003Cspan style=\"color:#005CC5\"> --filename\u003C/span>\u003Cspan style=\"color:#032F62\"> README.md\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># 2020/08/08 18:08:51 NameNode to connect to is localhost:9000\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># 2020/08/08 18:08:52 Put status: true\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">./godfs\u003C/span>\u003Cspan style=\"color:#032F62\"> client\u003C/span>\u003Cspan style=\"color:#005CC5\"> --namenode\u003C/span>\u003Cspan style=\"color:#032F62\"> localhost:9000\u003C/span>\u003Cspan style=\"color:#005CC5\"> --operation\u003C/span>\u003Cspan style=\"color:#032F62\"> get\u003C/span>\u003Cspan style=\"color:#005CC5\"> --filename\u003C/span>\u003Cspan style=\"color:#032F62\"> README.md\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># 2020/08/08 18:09:00 NameNode to connect to is localhost:9000\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># 2020/08/08 18:09:00 Get status: true\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6A737D\"># FILE CONTENTS ...\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch3 id=\"containerized-through-docker-compose\">Containerized through Docker Compose\u003C/h3>\n\u003Cp>In the \u003Ccode>docker-compose.yml\u003C/code> file, we try to define the DataNode and NameNode as independent services and the requested number of instances of the same will be spawned up. We have individual \u003Ccode>Dockerfile\u003C/code>s for the DataNode and NameNode.\u003C/p>\n\u003Cp>Assuming we have Docker set up in the host system, we have to build the images first:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">docker\u003C/span>\u003Cspan style=\"color:#032F62\"> build\u003C/span>\u003Cspan style=\"color:#005CC5\"> -t\u003C/span>\u003Cspan style=\"color:#032F62\"> datanode\u003C/span>\u003Cspan style=\"color:#005CC5\"> -f\u003C/span>\u003Cspan style=\"color:#032F62\"> daemon/datanode/Dockerfile\u003C/span>\u003Cspan style=\"color:#032F62\"> .\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">docker\u003C/span>\u003Cspan style=\"color:#032F62\"> build\u003C/span>\u003Cspan style=\"color:#005CC5\"> -t\u003C/span>\u003Cspan style=\"color:#032F62\"> namenode\u003C/span>\u003Cspan style=\"color:#005CC5\"> -f\u003C/span>\u003Cspan style=\"color:#032F62\"> daemon/namenode/Dockerfile\u003C/span>\u003Cspan style=\"color:#032F62\"> .\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">docker\u003C/span>\u003Cspan style=\"color:#032F62\"> build\u003C/span>\u003Cspan style=\"color:#005CC5\"> -t\u003C/span>\u003Cspan style=\"color:#032F62\"> client\u003C/span>\u003Cspan style=\"color:#005CC5\"> -f\u003C/span>\u003Cspan style=\"color:#032F62\"> daemon/client/Dockerfile\u003C/span>\u003Cspan style=\"color:#032F62\"> .\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>Now we can initiate a desired number of containers for DataNode and a single container for NameNode as:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">docker-compose\u003C/span>\u003Cspan style=\"color:#032F62\"> up\u003C/span>\u003Cspan style=\"color:#005CC5\"> --scale\u003C/span>\u003Cspan style=\"color:#032F62\"> datanode=\u003C/span>\u003Cspan style=\"color:#005CC5\">6\u003C/span>\u003Cspan style=\"color:#005CC5\"> --remove-orphans\u003C/span>\u003Cspan style=\"color:#005CC5\"> --force-recreate\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cp>Next, we would need a client in the same network to test out requests:\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"shell\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan style=\"color:#6F42C1\">docker\u003C/span>\u003Cspan style=\"color:#032F62\"> run\u003C/span>\u003Cspan style=\"color:#005CC5\"> -it\u003C/span>\u003Cspan style=\"color:#005CC5\"> --network\u003C/span>\u003Cspan style=\"color:#032F62\"> host\u003C/span>\u003Cspan style=\"color:#032F62\"> client\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Cblockquote>\n\u003Cp>TODO: Here we have allowed the DataNode containers to run within the \u003Cstrong>host\u003C/strong> network, i.e. its processes are now exposed to the host. We need some more sophistication in the isolation here.\u003C/p>\n\u003C/blockquote>\n\u003Cp>Either way of testing, to test the end-to-end working of the system, we not only want \u003Ccode>GET\u003C/code> Success, but also want to understand when such a DFS can fail. We can fetch the metadata from the NameNode on where all the blocks of a given file are kept. So, theoretically, if \u003Ccode>replication-factor\u003C/code> is 2 and we identify those 2 DataNodes for a particular file BlockId, we can then experiment with the edge cases of distributed systems by killing those two containers. And then we should no longer be able to fetch the complete file (since a part of it does not exist in any of the data nodes). If practice matches the above theory, we are good to go :)!\u003C/p>",{"headings":160,"localImagePaths":198,"remoteImagePaths":199,"frontmatter":200,"imagePaths":203},[161,164,167,170,174,177,180,183,186,189,192,195],{"depth":28,"slug":162,"text":163},"building-go-distributed-file-system","Building Go Distributed File System",{"depth":32,"slug":165,"text":166},"abstracting-away-the-odds","Abstracting away the odds",{"depth":32,"slug":168,"text":169},"the-pieces","The pieces",{"depth":171,"slug":172,"text":173},4,"datanode","DataNode",{"depth":171,"slug":175,"text":176},"namenode","NameNode",{"depth":171,"slug":178,"text":179},"client","Client",{"depth":32,"slug":181,"text":182},"the-chunks","The chunks",{"depth":32,"slug":184,"text":185},"the-replication","The replication",{"depth":32,"slug":187,"text":188},"the-talking","The talking",{"depth":28,"slug":190,"text":191},"setting-it-up","Setting it up",{"depth":32,"slug":193,"text":194},"natively-on-local-host","Natively on local host",{"depth":32,"slug":196,"text":197},"containerized-through-docker-compose","Containerized through Docker Compose",[],[],{"title":149,"date":201,"tags":202,"draft":19},["Date","2020-08-09T00:00:00.000Z"],[152,153],[],"homelab",{"id":204,"data":206,"body":211,"filePath":212,"digest":213,"rendered":214},{"title":207,"date":208,"tags":209,"draft":19},"Just setting up my homelab",["Date","2023-02-18T00:00:00.000Z"],[72,210],"hobby","Over the last few years, I've been obsessively reading on responsible technology and information warfare. The absolute favourites in this space have been [Permanent Record](https://www.goodreads.com/book/show/46223297-permanent-record) and [Mindf*ck](https://www.goodreads.com/en/book/show/52269471). The hobby of homelabbing and having control over my own data originates somewhere around that. I had earlier [written about](/notes/firefly) why I think Firefly-III helped me achieve the \"personal\" in personal finance. The joy of running a server 24x7 in your living room is mostly about cultivating dopamine and value from custom-built software. Although most of what we run is off-the-shelf OSS projects, however the extensions and close-knit integrations between them is where the magic happens. As with every hobby, running a homelab is a journey - it is never perfect, but always better than before.\n\n## Tales of my homelab journey\n\n### One small drop in the ocean, one giant leap for ambition\n\nI took my first attempt at it during my undergraduate years - it was a tiny 1GB DigitalOcean droplet which ran just a couple of applications. With no hardware to worry about, all the worry went into thinking how my long wishlist of items would even fit into that one gig! Although containerization was picking up rapidly at that time, I amusingly chose to compile binaries right within the machine, and ship them as `systemd` services. I know you wouldn't believe, but there was a time when I'd be lazy to write `systemd` service configuration files and instead run it inside detached `tmux` sessions. There would never be the need to restart the droplet, and we were high on hopes that the `tmux` sessions would never die! The cloud game is fun, with easy public IPv4 and all, but upgading to a high-spec droplet was kinda unaffordable as a college student. The droplet had its good times with some of my friends also deploying hobby applications to it - but needless to say, scaling up hardware was the need of the hour.\n\n### The Homelab - Bring Him Home\n\nAs I was progressing in my career, organically came the need to track/juggle multiple tasks, and getting reminded of them at the right times. I found myself re-experimenting with TODO managers. With the same FOSS philosophy in mind, I wanted something that's hackable, cross-platform and nifty. Stumbling upon [Vikunja](https://vikunja.io/), I immediately knew *this* is what I needed. Again around December 2021, we went for a [Himalayan trek](/notes/himalayan-trek) Back from the mountains, we had to create a shareable (web) gallery of all our scenic photos and vlogs. DSLR and GoPro media was too big to fit on the Google Photos / Drive free plan. And that called for a better plan. It's funny to draw these connections, but these were indeed the signals of evolution. Taking opinions from my friends, we thought of going ahead with products like [Nextcloud](https://nextcloud.com/) or [Photoprism](https://www.photoprism.app/) (both of which are self-hosted photo/video sharing products). I decided that it was the time to invest into a 8GB Raspberry Pi, and migrate the DigitalOcean droplet to the Pi. Or well, you can also rephrase as - it was finally time to bring the homelab ... home.\n\n![Freshly plucked Raspberry Pi](/images/raspberry_pi.jpg)\n\nI thought I'll be able to quickly get the migration done dedicating some late nights and weekends. Also, having learnt Ansible and Infrastructure-as-Code at work, I decided to make good use of the opportunity. Conversely, *just* migrating the sphaggeti code didn't make sense in terms of future scalability - if I were to onboard other self-hosted applications into it, I'd have to craft a systematic way of deploying and maintaining. Multiple other things like SSH access (for administration) and exposing publicly had to be figured out. Back then I did have a little experience working with Kubernetes and I wasn't really bullish on it given the operational complexity. Hashicorp Nomad came to the rescue having read about [similar](https://mrkaran.dev/posts/home-server-nomad/) [setups](https://github.com/assareh/home-lab). The Tailscale team came out with their [amazingly smooth Wireguard VPN](https://tailscale.com/blog/how-tailscale-works/) product in mid-2020, and so did the Cloudflare team with [Cloudflare Tunnels](https://blog.cloudflare.com/tunnel-for-everyone/). In hindsight it does feel like the right-place, right-time - these products indeed made my life much easier! With about two weeks of hacking, I had neat subdomains ready for eight (up from three!) of my self-hosted applications. It was unbelievable that an affordable pocket Raspberry Pi had 4 vCPUs, 8GB of RAM and could run all my applications so smooth. I was initially using [UNIX Password Store](https://www.passwordstore.org/) (local) for all the deployment secrets, but with the migration to Bitwarden, GitOps (deploy on every `main` commit through GitHub Actions) was an actual thing!\n\n![Enclosed Pi server (there used to be a USB-connected HDD for persistent storage back then)](/images/raspberry_pi_server.jpg)\n\n### Old drawers to the rescue\n\nThere's a psychological hope cycle when dealing with Raspberry Pi homeservers - first you tend to underestimate these tiny devices, then you keeping loading it with stuff and get amazed at how much it can get done. Unfortunately the last phase is the Pi struggling to keep up with your perceived overestimations. And of course, summer heat plays spoilersport. I soon realized that my CPU, and not memory requirements had overgrown the Pi. Coincidentally we had a \"computer room\" with multiple legacy desktops and laptops lying around - most of them outdated hardware. The curious in me wanted to repurpose some of them into a homelab multi-node cluster. But to headstart simple, I chose a Dell Latitude E6400 (my father's one-upon-a-time workstation) and went all-into the migration yet again. Migration was super simple this time except the pains of `scp`-ing the huge data directory and rebuilding some container images for AMD64 (Pi was ARM64 V8).\n\n![Dell Latitude working hard in silence right on my workstation](/images/dell_latitude_server.jpeg)\n\nThe stint with the Dell Latitude as my homelab hardware was sweet yet short. The sweetness comes from the fact that laptops have batteries (and are hence tolerant to power outages) and a screen (which helps enormously for first-time & urgent debugging scenarios). Although the Intel Core2Duo was theoretically much more performant than ARM Cortex A72, decade-old hardware is ... well, decade old. I/O intensive tasks like Photoprism video transcoding, Nextcloud, Duplicati were struggling to keep up - *the two poor cores were interrupted way too much to do any useful work*. It was clear indication that I needed to invest in modern hardware.\n\n### A big, black box beside the couch\n\nThanks to Moore's law, hardware prices deprecates faster than their effectiveness. I was able to grab a second-hand desktop PC sporting 7th generation Intel i5 and 16GB of RAM. And finally it felt like a rocketship, just to quote it as,\n\n> There's a point – 7000 RPM – where everything fades. When your seeing becomes weightless, just disappears. And all that's left is a body moving through space and time. 7000 RPM that's where you meet it.\n\nI don't claim to understand hyperthreading technology completely, but my benchmarking experiments showed impressive results. The luxury of having a lot of RAM meant the freedom to *move fast and deploy things*. Nextcloud synchronization, Photoprism image loading times, Duplicati backup durations showed prominent improvement. And with desktop-grade fans, finally I didn't have to worry about active cooling. Occasionally I celebrate the fact that my machine neither heats up the room, nor does it make any greater noise than an Apple Silicon Mac.\n\n![Humble yet powerful desktop server](/images/desktop_server.jpg)\n\n## What's cooking in my lab\n\nIf you happen to do homelabbing as a hobby, you know that there's the on-premise advantage of it. Self-hosting essentially means that all the data gets written to a disk owned by you. And open-source software means that it is never going away unlike Google's chat apps. I tend to self-host a variety of applications from [TODO apps](https://kolaente.dev/vikunja), [wiki/documentation apps](https://github.com/BookStackApp/BookStack), [personal finance managers](https://github.com/firefly-iii/firefly-iii), [file cloud](https://github.com/nextcloud), [photo/video gallery](https://github.com/immich-app/immich) and such. There's a productivity category which contains things like [snippets organizer](https://github.com/MohamedElashri/Snibox), [spaced-repetition for remembering](https://github.com/memoetapp/memoet) etc. Then comes the obvious media cateogy - think of self-hosted versions of [Google Play Books](https://github.com/Kareadita/Kavita), [Audible](https://github.com/advplyr/audiobookshelf), [Netflix](https://github.com/jellyfin/jellyfin) and so on. There's also duct-tape tools like [NTFY](https://github.com/binwiederhier/ntfy) (a cool REST interface for push notifications), [Cronicle](https://github.com/jhuckaby/Cronicle) (cron on steroids), [Duplicati](https://github.com/duplicati/duplicati) (incremental, encrypted backups) and [RSS readers](https://github.com/miniflux/v2). The full list of available on the [GitHub Readme](https://github.com/rounakdatta/homelab.setup#list-of-self-hosted-applications). And NO, I DO NOT SELF-HOST EMAIL.\n\nIn case you've been wondering, I've been using Ubuntu server on both the current desktop machine, as well as the past Dell Latitude laptop. And there's the very cool [DietPi](https://dietpi.com/) which I used to run on my Raspberry Pi. On container orchestration front, I'm a fan of the simple, straightforward philosophy of Hashicorp Nomad.\n\n![An average day on the Nomad dashboard](/images/nomad_dashboard.png)\n\n## Learnings and what's next\n\n- Being prepared to experiment. Although my intended audience for the homelab was small (me, my family and some friends), still hosting heavy applications means that you have to have knowhow of container resource tuning and being comfortable on the command line.\n- Measuring effort-to-value ratio before an action. It is easy to get carried away by all the fancy enterprise-grade hardware and complex networking setup (we do a lot of that in [r/homelab](https://www.reddit.com/r/homelab/)). But I've always been conscious of whether at all a technical improvement will bring about a real value addition. Afterall, it isn't production software, it's a homelab with a personal touch.\n- Taking security seriously. With tools like Tailscale in the ecosystem, it is definitely easy to *have your private garden over VPN*. But still, even if we are exposing applications publicly, we must be aware of the risks of it. For example, if exposing publicly via Cloudflare Tunnels, Zero Trust Access is something to consider. Most importantly, if you're storing confidential/sensitive/objectional data in your homelab, prioritize security over convenience!\n- Introduce monitoring, but be careful about overdoing it. Not all self-hosted applications come with telemetry built in, however it is moderately important to have some kind of host monitoring set up. Afterall, you wouldn't want your system to go up in flames because of a DDOS.\n- I definitely wanted to build a distributed cluster - a fleet of machines which load-balance the compute. And a Ceph/SeaweedFS like distributed POSIX filesystem for all persistent storage requirements. While it increases reliability, it of course brings in a lot of operational complexity. Hence at the moment, it's a nice-to-have instead of a must-have.\n- Running a hardware machine 24x7 isn't trivial if your residence is prone to frequent power cuts or poor broadband internet connection. In those cases, it's justified to rent out the cloud. In the long term, cost of owning hardware will balance out cost of renting equivalent hardware. Needless to say, cloud's reliability is unmatched.\n- While Ansible does work good, it doesn't honour the spirits of functional programming. I have a long term plan to re-write my IaC in something like Nix. That doesn't give me any performance / quality improvements, but improves reproducibility and confidence to experiment without fear.\n\n![Homelab meme](/images/homelab_overengineering_meme.jpg)\n\nThat's all for the writeup!","src/content/notes/homelab.md","7dca5dd250901cde",{"html":215,"metadata":216},"\u003Cp>Over the last few years, I’ve been obsessively reading on responsible technology and information warfare. The absolute favourites in this space have been \u003Ca href=\"https://www.goodreads.com/book/show/46223297-permanent-record\">Permanent Record\u003C/a> and \u003Ca href=\"https://www.goodreads.com/en/book/show/52269471\">Mindf*ck\u003C/a>. The hobby of homelabbing and having control over my own data originates somewhere around that. I had earlier \u003Ca href=\"/notes/firefly\">written about\u003C/a> why I think Firefly-III helped me achieve the “personal” in personal finance. The joy of running a server 24x7 in your living room is mostly about cultivating dopamine and value from custom-built software. Although most of what we run is off-the-shelf OSS projects, however the extensions and close-knit integrations between them is where the magic happens. As with every hobby, running a homelab is a journey - it is never perfect, but always better than before.\u003C/p>\n\u003Ch2 id=\"tales-of-my-homelab-journey\">Tales of my homelab journey\u003C/h2>\n\u003Ch3 id=\"one-small-drop-in-the-ocean-one-giant-leap-for-ambition\">One small drop in the ocean, one giant leap for ambition\u003C/h3>\n\u003Cp>I took my first attempt at it during my undergraduate years - it was a tiny 1GB DigitalOcean droplet which ran just a couple of applications. With no hardware to worry about, all the worry went into thinking how my long wishlist of items would even fit into that one gig! Although containerization was picking up rapidly at that time, I amusingly chose to compile binaries right within the machine, and ship them as \u003Ccode>systemd\u003C/code> services. I know you wouldn’t believe, but there was a time when I’d be lazy to write \u003Ccode>systemd\u003C/code> service configuration files and instead run it inside detached \u003Ccode>tmux\u003C/code> sessions. There would never be the need to restart the droplet, and we were high on hopes that the \u003Ccode>tmux\u003C/code> sessions would never die! The cloud game is fun, with easy public IPv4 and all, but upgading to a high-spec droplet was kinda unaffordable as a college student. The droplet had its good times with some of my friends also deploying hobby applications to it - but needless to say, scaling up hardware was the need of the hour.\u003C/p>\n\u003Ch3 id=\"the-homelab---bring-him-home\">The Homelab - Bring Him Home\u003C/h3>\n\u003Cp>As I was progressing in my career, organically came the need to track/juggle multiple tasks, and getting reminded of them at the right times. I found myself re-experimenting with TODO managers. With the same FOSS philosophy in mind, I wanted something that’s hackable, cross-platform and nifty. Stumbling upon \u003Ca href=\"https://vikunja.io/\">Vikunja\u003C/a>, I immediately knew \u003Cem>this\u003C/em> is what I needed. Again around December 2021, we went for a \u003Ca href=\"/notes/himalayan-trek\">Himalayan trek\u003C/a> Back from the mountains, we had to create a shareable (web) gallery of all our scenic photos and vlogs. DSLR and GoPro media was too big to fit on the Google Photos / Drive free plan. And that called for a better plan. It’s funny to draw these connections, but these were indeed the signals of evolution. Taking opinions from my friends, we thought of going ahead with products like \u003Ca href=\"https://nextcloud.com/\">Nextcloud\u003C/a> or \u003Ca href=\"https://www.photoprism.app/\">Photoprism\u003C/a> (both of which are self-hosted photo/video sharing products). I decided that it was the time to invest into a 8GB Raspberry Pi, and migrate the DigitalOcean droplet to the Pi. Or well, you can also rephrase as - it was finally time to bring the homelab … home.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/raspberry_pi.jpg\" alt=\"Freshly plucked Raspberry Pi\">\u003C/p>\n\u003Cp>I thought I’ll be able to quickly get the migration done dedicating some late nights and weekends. Also, having learnt Ansible and Infrastructure-as-Code at work, I decided to make good use of the opportunity. Conversely, \u003Cem>just\u003C/em> migrating the sphaggeti code didn’t make sense in terms of future scalability - if I were to onboard other self-hosted applications into it, I’d have to craft a systematic way of deploying and maintaining. Multiple other things like SSH access (for administration) and exposing publicly had to be figured out. Back then I did have a little experience working with Kubernetes and I wasn’t really bullish on it given the operational complexity. Hashicorp Nomad came to the rescue having read about \u003Ca href=\"https://mrkaran.dev/posts/home-server-nomad/\">similar\u003C/a> \u003Ca href=\"https://github.com/assareh/home-lab\">setups\u003C/a>. The Tailscale team came out with their \u003Ca href=\"https://tailscale.com/blog/how-tailscale-works/\">amazingly smooth Wireguard VPN\u003C/a> product in mid-2020, and so did the Cloudflare team with \u003Ca href=\"https://blog.cloudflare.com/tunnel-for-everyone/\">Cloudflare Tunnels\u003C/a>. In hindsight it does feel like the right-place, right-time - these products indeed made my life much easier! With about two weeks of hacking, I had neat subdomains ready for eight (up from three!) of my self-hosted applications. It was unbelievable that an affordable pocket Raspberry Pi had 4 vCPUs, 8GB of RAM and could run all my applications so smooth. I was initially using \u003Ca href=\"https://www.passwordstore.org/\">UNIX Password Store\u003C/a> (local) for all the deployment secrets, but with the migration to Bitwarden, GitOps (deploy on every \u003Ccode>main\u003C/code> commit through GitHub Actions) was an actual thing!\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/raspberry_pi_server.jpg\" alt=\"Enclosed Pi server (there used to be a USB-connected HDD for persistent storage back then)\">\u003C/p>\n\u003Ch3 id=\"old-drawers-to-the-rescue\">Old drawers to the rescue\u003C/h3>\n\u003Cp>There’s a psychological hope cycle when dealing with Raspberry Pi homeservers - first you tend to underestimate these tiny devices, then you keeping loading it with stuff and get amazed at how much it can get done. Unfortunately the last phase is the Pi struggling to keep up with your perceived overestimations. And of course, summer heat plays spoilersport. I soon realized that my CPU, and not memory requirements had overgrown the Pi. Coincidentally we had a “computer room” with multiple legacy desktops and laptops lying around - most of them outdated hardware. The curious in me wanted to repurpose some of them into a homelab multi-node cluster. But to headstart simple, I chose a Dell Latitude E6400 (my father’s one-upon-a-time workstation) and went all-into the migration yet again. Migration was super simple this time except the pains of \u003Ccode>scp\u003C/code>-ing the huge data directory and rebuilding some container images for AMD64 (Pi was ARM64 V8).\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/dell_latitude_server.jpeg\" alt=\"Dell Latitude working hard in silence right on my workstation\">\u003C/p>\n\u003Cp>The stint with the Dell Latitude as my homelab hardware was sweet yet short. The sweetness comes from the fact that laptops have batteries (and are hence tolerant to power outages) and a screen (which helps enormously for first-time &#x26; urgent debugging scenarios). Although the Intel Core2Duo was theoretically much more performant than ARM Cortex A72, decade-old hardware is … well, decade old. I/O intensive tasks like Photoprism video transcoding, Nextcloud, Duplicati were struggling to keep up - \u003Cem>the two poor cores were interrupted way too much to do any useful work\u003C/em>. It was clear indication that I needed to invest in modern hardware.\u003C/p>\n\u003Ch3 id=\"a-big-black-box-beside-the-couch\">A big, black box beside the couch\u003C/h3>\n\u003Cp>Thanks to Moore’s law, hardware prices deprecates faster than their effectiveness. I was able to grab a second-hand desktop PC sporting 7th generation Intel i5 and 16GB of RAM. And finally it felt like a rocketship, just to quote it as,\u003C/p>\n\u003Cblockquote>\n\u003Cp>There’s a point – 7000 RPM – where everything fades. When your seeing becomes weightless, just disappears. And all that’s left is a body moving through space and time. 7000 RPM that’s where you meet it.\u003C/p>\n\u003C/blockquote>\n\u003Cp>I don’t claim to understand hyperthreading technology completely, but my benchmarking experiments showed impressive results. The luxury of having a lot of RAM meant the freedom to \u003Cem>move fast and deploy things\u003C/em>. Nextcloud synchronization, Photoprism image loading times, Duplicati backup durations showed prominent improvement. And with desktop-grade fans, finally I didn’t have to worry about active cooling. Occasionally I celebrate the fact that my machine neither heats up the room, nor does it make any greater noise than an Apple Silicon Mac.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/desktop_server.jpg\" alt=\"Humble yet powerful desktop server\">\u003C/p>\n\u003Ch2 id=\"whats-cooking-in-my-lab\">What’s cooking in my lab\u003C/h2>\n\u003Cp>If you happen to do homelabbing as a hobby, you know that there’s the on-premise advantage of it. Self-hosting essentially means that all the data gets written to a disk owned by you. And open-source software means that it is never going away unlike Google’s chat apps. I tend to self-host a variety of applications from \u003Ca href=\"https://kolaente.dev/vikunja\">TODO apps\u003C/a>, \u003Ca href=\"https://github.com/BookStackApp/BookStack\">wiki/documentation apps\u003C/a>, \u003Ca href=\"https://github.com/firefly-iii/firefly-iii\">personal finance managers\u003C/a>, \u003Ca href=\"https://github.com/nextcloud\">file cloud\u003C/a>, \u003Ca href=\"https://github.com/immich-app/immich\">photo/video gallery\u003C/a> and such. There’s a productivity category which contains things like \u003Ca href=\"https://github.com/MohamedElashri/Snibox\">snippets organizer\u003C/a>, \u003Ca href=\"https://github.com/memoetapp/memoet\">spaced-repetition for remembering\u003C/a> etc. Then comes the obvious media cateogy - think of self-hosted versions of \u003Ca href=\"https://github.com/Kareadita/Kavita\">Google Play Books\u003C/a>, \u003Ca href=\"https://github.com/advplyr/audiobookshelf\">Audible\u003C/a>, \u003Ca href=\"https://github.com/jellyfin/jellyfin\">Netflix\u003C/a> and so on. There’s also duct-tape tools like \u003Ca href=\"https://github.com/binwiederhier/ntfy\">NTFY\u003C/a> (a cool REST interface for push notifications), \u003Ca href=\"https://github.com/jhuckaby/Cronicle\">Cronicle\u003C/a> (cron on steroids), \u003Ca href=\"https://github.com/duplicati/duplicati\">Duplicati\u003C/a> (incremental, encrypted backups) and \u003Ca href=\"https://github.com/miniflux/v2\">RSS readers\u003C/a>. The full list of available on the \u003Ca href=\"https://github.com/rounakdatta/homelab.setup#list-of-self-hosted-applications\">GitHub Readme\u003C/a>. And NO, I DO NOT SELF-HOST EMAIL.\u003C/p>\n\u003Cp>In case you’ve been wondering, I’ve been using Ubuntu server on both the current desktop machine, as well as the past Dell Latitude laptop. And there’s the very cool \u003Ca href=\"https://dietpi.com/\">DietPi\u003C/a> which I used to run on my Raspberry Pi. On container orchestration front, I’m a fan of the simple, straightforward philosophy of Hashicorp Nomad.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/nomad_dashboard.png\" alt=\"An average day on the Nomad dashboard\">\u003C/p>\n\u003Ch2 id=\"learnings-and-whats-next\">Learnings and what’s next\u003C/h2>\n\u003Cul>\n\u003Cli>Being prepared to experiment. Although my intended audience for the homelab was small (me, my family and some friends), still hosting heavy applications means that you have to have knowhow of container resource tuning and being comfortable on the command line.\u003C/li>\n\u003Cli>Measuring effort-to-value ratio before an action. It is easy to get carried away by all the fancy enterprise-grade hardware and complex networking setup (we do a lot of that in \u003Ca href=\"https://www.reddit.com/r/homelab/\">r/homelab\u003C/a>). But I’ve always been conscious of whether at all a technical improvement will bring about a real value addition. Afterall, it isn’t production software, it’s a homelab with a personal touch.\u003C/li>\n\u003Cli>Taking security seriously. With tools like Tailscale in the ecosystem, it is definitely easy to \u003Cem>have your private garden over VPN\u003C/em>. But still, even if we are exposing applications publicly, we must be aware of the risks of it. For example, if exposing publicly via Cloudflare Tunnels, Zero Trust Access is something to consider. Most importantly, if you’re storing confidential/sensitive/objectional data in your homelab, prioritize security over convenience!\u003C/li>\n\u003Cli>Introduce monitoring, but be careful about overdoing it. Not all self-hosted applications come with telemetry built in, however it is moderately important to have some kind of host monitoring set up. Afterall, you wouldn’t want your system to go up in flames because of a DDOS.\u003C/li>\n\u003Cli>I definitely wanted to build a distributed cluster - a fleet of machines which load-balance the compute. And a Ceph/SeaweedFS like distributed POSIX filesystem for all persistent storage requirements. While it increases reliability, it of course brings in a lot of operational complexity. Hence at the moment, it’s a nice-to-have instead of a must-have.\u003C/li>\n\u003Cli>Running a hardware machine 24x7 isn’t trivial if your residence is prone to frequent power cuts or poor broadband internet connection. In those cases, it’s justified to rent out the cloud. In the long term, cost of owning hardware will balance out cost of renting equivalent hardware. Needless to say, cloud’s reliability is unmatched.\u003C/li>\n\u003Cli>While Ansible does work good, it doesn’t honour the spirits of functional programming. I have a long term plan to re-write my IaC in something like Nix. That doesn’t give me any performance / quality improvements, but improves reproducibility and confidence to experiment without fear.\u003C/li>\n\u003C/ul>\n\u003Cp>\u003Cimg src=\"/images/homelab_overengineering_meme.jpg\" alt=\"Homelab meme\">\u003C/p>\n\u003Cp>That’s all for the writeup!\u003C/p>",{"headings":217,"localImagePaths":239,"remoteImagePaths":240,"frontmatter":241,"imagePaths":244},[218,221,224,227,230,233,236],{"depth":28,"slug":219,"text":220},"tales-of-my-homelab-journey","Tales of my homelab journey",{"depth":32,"slug":222,"text":223},"one-small-drop-in-the-ocean-one-giant-leap-for-ambition","One small drop in the ocean, one giant leap for ambition",{"depth":32,"slug":225,"text":226},"the-homelab---bring-him-home","The Homelab - Bring Him Home",{"depth":32,"slug":228,"text":229},"old-drawers-to-the-rescue","Old drawers to the rescue",{"depth":32,"slug":231,"text":232},"a-big-black-box-beside-the-couch","A big, black box beside the couch",{"depth":28,"slug":234,"text":235},"whats-cooking-in-my-lab","What’s cooking in my lab",{"depth":28,"slug":237,"text":238},"learnings-and-whats-next","Learnings and what’s next",[],[],{"title":207,"date":242,"tags":243,"draft":19},["Date","2023-02-18T00:00:00.000Z"],[72,210],[],"open-source-tools-everyday",{"id":245,"data":247,"body":252,"filePath":253,"digest":254,"rendered":255},{"title":248,"date":249,"tags":250,"draft":19},"My everyday tooling around OSS",["Date","2021-01-03T00:00:00.000Z"],[17,251],"emacs","> Speed and efficiency are two different things. ~Rasheed Ogunlaru\n\nWe as engineers love streamlining our workflows. It all boils down to the sheer need and desire for greater control and visibility. In a utopian world, how we think of [DAOs](https://en.wikipedia.org/wiki/Decentralized_autonomous_organization) is the same way we think of our workflows in the real world. The term workflows I'm using could essentially be as simple as cleaning junk (yeah, those donotreply promotional) emails to setting up a blog publishing pipeline. The task themselves might sound trivial, but the point here is how idempotent or how scalable the workflow is. Asking questions like \"What if I have to manage cleaning a few hundred inboxes tomorrow?\" should clarify the problem in hand more.\n\nAnd therefore, this writeup talks on tools and mindsets around setting up such workflows through computer programs.\n\n## What's in a text editor?\n\nI used a handful of text editors so far, and honestly, Emacs was the first editor which encouraged (read *required*) me to read one full [book](https://www.goodreads.com/book/show/25587882-mastering-emacs) while getting started with it! Text editing had never been such fun and personalized before. And within weeks I found myself to be using Emacs on window mode (minimalist me who runs stuff right in the terminal -_-), ditching JetBrains for lsp-mode, plaintext notetaking in org-roam, trading in Chromemacs for vimium and daringly writing simple elisp functions.\n\nI'm no text ninja yet, but my overall productivity on the keyboard has increased by folds and maintaing such an extensible editor by creating workflows of my choice has been a blessing in 2020. I now launch projectiles, ripgrep instead of grep, magit instead of git, org-roam instead of notion, ox-hugo instead of notablog and of course it's aM-xing! I thought you'd ask, but now I also [vimgolf](http://www.vimgolf.com/) in emacs for fun ;).\n\nMy trajectory in Emacs has just started, and to make the start smooth I went ahead with [doom](https://github.com/hlissner/doom-emacs) with no evil (no pun intended, the original Emacs keybindings got me right in the feels). To reverbate with the community, I truly found Emacs to be *thermonuclear word processor*.\n\n### What I type is what you see\n\nIt is now 2021 and I have decided to be a full-time Emacsian. This means that the \"texts\" I edit furthur would most probably be written in Emacs itself. In the past, I have experimented with blogg-struggl-ing with raw html-css based blogs with manually maintained indexing and navigation, Notion-as-CMS with notablog (quite an impressive project, check it out). For me, private notetaking and public blogging had never converged before I came across [Roam Research](https://roamresearch.com/). And with its pricing, came a slew of open-source alternatives of which [org-roam](https://github.com/org-roam/org-roam) fit my bill finally. The community has left no stone unturned, and thus with org-roam, we have [ox-hugo](https://github.com/kaushalmodi/ox-hugo) as the transport protocol to web publishing. I chose the [Er](https://github.com/lingxz/er) theme thinking it'd be pleasing to my readers' eyes (is it?). The figure below would help you figure out how much I literally mean the phrase \"Written and published right from Emacs Org-mode.\":\n\n![Blog publish flow - seamless, isn't it?](/images/blog_publish_flow.png)\n\n## First we shape our tools, thereafter they shape us\n\nWith so much of Emacs bragging, my love towards **extensible, configurable and idempotent** behaviour of tools might be somewhat clear to you. And tada, with that we'd now cover an alternative approach to maintaining dotfiles and provisioning personalized systems really fast.\n\n### My dotfiles setup\n\nDotfiles are no longer fancy, and so is mine. However, I try to cover the configuration files of most of the applicable softwares I use. While having fish, doom, vim, tmux etc in one's dotfile is a no-brainer, I also keep my backup systems (which includes scripts and their schedules) checked in. Sadly on macOS, there are more mature tools than `cron` thus breaking Linux compatibility.\n\nYou can take a look at my [dotfiles](https://github.com/rounakdatta/dotfiles), they are very minimalistic.\n\n### Set them up with ansible\n\nWe all used hacky dotfile bootstrapping scripts which had to be maintained, cleaned and generic-ized again and again. However, with ansible, stuff becomes much more easier and streamlined. Idempotency, unit tests, configurability, you name it!\n\nAnd I use my ansible playbooks not only for symlinking dotfiles, but most importantly for installing, configuring softwares (from source, from release binaries, from app stores, you name it!). Thanks to my password-store setup, I now can plug my passwords into environment variables and put them on a public git repository like this.\n\nYou'll definitely want to look at and make good use of my [computer.setup](https://github.com/rounakdatta/computer.setup). If the aforementioned sound quite new (and exciting) to you, let's start with some gentle Ansible storytelling [here](https://opensource.com/article/19/9/ansible-documentation-kids-laptops), followed by some [war stories](https://rgoswami.me/posts/prov-dots/). Developers generally make use of this swiss knife Ansible to provision servers (read installing software on auto-pilot) with pre-baked images as well as patches (generally coupled with Terraform) in plain simple YAML.\n\n## Privacy comes at a price\n\nAnd we pay the price once by upskilling, or every month by not. I've always been skeptical about handing over my passwords to a browser's internal cloud (i.e. giving it the authority to store passwords on their end in exchange of super-convenience). They suck because not only it's a browser lock-in, but also they say no to custom password rules/length, multi-password-same-domain and many more novel ideas around password management. [pass](https://www.passwordstore.org/) is a sweet, simple UNIX-philosophy command-line manager to the rescue. Not only does it tactfully solve the above issues, it also has built a fantastic ecosystem around itself with [gopass](https://www.gopass.pw/), [pass-update](https://github.com/roddhjav/pass-update) to name a few.\n\nWith tools like [gopass](https://github.com/gopasspw/gopass) and [gopassbridge](https://github.com/gopasspw/gopassbridge), its a simple, multi-browser-compatible flow of passwords with my setup backed up regularly at a remote private [tombed](https://www.dyne.org/software/tomb/) git repository.\n\nDid I forget to tell you that the awesome [Android app](https://github.com/android-password-store/Android-Password-Store) by [Harsh](https://twitter.com/msfjarvis) has app-level autocomplete and git synchronization support built in?\n\nDid I also forget to tell you that I contributed back to [gopassbridge](https://github.com/gopasspw/gopassbridge/pull/177) and the [Android app](https://github.com/android-password-store/Android-Password-Store/pull/1091)?\n\n## Organizing finance, knowledge\n\nAll the while we've been sharpening the tools we'd work with everyday. Now, with everyday the most organizational pain could be personal finance and knowledge. Yes, we've covered another self-hosted software Firefly and the hacks around it in a [different blog post](/notes/firefly). And we definitely can do better with GNUCash for other fast-moving investments tracking. Local GNUCash client + remote database is my favourite setup.\n\nWhen it comes to bookmarks management, its again in general a case of browser lock-in. If not lock-in, it could be poor, hacky synchronization strategies. Ideally, bookmark manager should be an independent software module, and [buku](https://github.com/jarun/buku) does its job nicely here. buku also has a good webserver (which can preferably run locally on demand) for the data analyst within you!\n\n## Files - the most important ones\n\nAll files are important, but those which act as bonafide, memoir or personal spreadsheets/documents are important with somewhat greater magnitude. The average person uses Google Drive or the equivalents to not lose visibility of their files. With worryingly powerful full-text search, it's unclear how much privacy we are trading off for the convenience. And therefore, with some effort, I've managed to setup Backbaze B2 as my backup solution for important documents. They provide generous free limits and full revision history and [rclone](https://rclone.org/) has good support for it. Thus, even though my backups are once-a-day-batch and B2 lacks a good mobile client, the privacy balance has been quite fruitful for me. Backblaze B2 APIs are S3 compatible, and therefore Android clients like [FolderSync](https://play.google.com/store/apps/details?id=dk.tacit.android.foldersync.lite) make the cut well! ;)\n\nAs a closing thought, please feel free to let me know if any of the sections seem not-said-enough. Most of the config/scripts/design in this context is open-source and invites improvement of any kind.\n\nIf this post made you think differently today, let us thank the reviewer [Rounak Vyas](https://rounakvyas.me/) and check out his amazing and witty writings.","src/content/notes/open-source-tools-everyday.md","c3f669f62e94cc06",{"html":256,"metadata":257},"\u003Cblockquote>\n\u003Cp>Speed and efficiency are two different things. ~Rasheed Ogunlaru\u003C/p>\n\u003C/blockquote>\n\u003Cp>We as engineers love streamlining our workflows. It all boils down to the sheer need and desire for greater control and visibility. In a utopian world, how we think of \u003Ca href=\"https://en.wikipedia.org/wiki/Decentralized_autonomous_organization\">DAOs\u003C/a> is the same way we think of our workflows in the real world. The term workflows I’m using could essentially be as simple as cleaning junk (yeah, those donotreply promotional) emails to setting up a blog publishing pipeline. The task themselves might sound trivial, but the point here is how idempotent or how scalable the workflow is. Asking questions like “What if I have to manage cleaning a few hundred inboxes tomorrow?” should clarify the problem in hand more.\u003C/p>\n\u003Cp>And therefore, this writeup talks on tools and mindsets around setting up such workflows through computer programs.\u003C/p>\n\u003Ch2 id=\"whats-in-a-text-editor\">What’s in a text editor?\u003C/h2>\n\u003Cp>I used a handful of text editors so far, and honestly, Emacs was the first editor which encouraged (read \u003Cem>required\u003C/em>) me to read one full \u003Ca href=\"https://www.goodreads.com/book/show/25587882-mastering-emacs\">book\u003C/a> while getting started with it! Text editing had never been such fun and personalized before. And within weeks I found myself to be using Emacs on window mode (minimalist me who runs stuff right in the terminal -_-), ditching JetBrains for lsp-mode, plaintext notetaking in org-roam, trading in Chromemacs for vimium and daringly writing simple elisp functions.\u003C/p>\n\u003Cp>I’m no text ninja yet, but my overall productivity on the keyboard has increased by folds and maintaing such an extensible editor by creating workflows of my choice has been a blessing in 2020. I now launch projectiles, ripgrep instead of grep, magit instead of git, org-roam instead of notion, ox-hugo instead of notablog and of course it’s aM-xing! I thought you’d ask, but now I also \u003Ca href=\"http://www.vimgolf.com/\">vimgolf\u003C/a> in emacs for fun ;).\u003C/p>\n\u003Cp>My trajectory in Emacs has just started, and to make the start smooth I went ahead with \u003Ca href=\"https://github.com/hlissner/doom-emacs\">doom\u003C/a> with no evil (no pun intended, the original Emacs keybindings got me right in the feels). To reverbate with the community, I truly found Emacs to be \u003Cem>thermonuclear word processor\u003C/em>.\u003C/p>\n\u003Ch3 id=\"what-i-type-is-what-you-see\">What I type is what you see\u003C/h3>\n\u003Cp>It is now 2021 and I have decided to be a full-time Emacsian. This means that the “texts” I edit furthur would most probably be written in Emacs itself. In the past, I have experimented with blogg-struggl-ing with raw html-css based blogs with manually maintained indexing and navigation, Notion-as-CMS with notablog (quite an impressive project, check it out). For me, private notetaking and public blogging had never converged before I came across \u003Ca href=\"https://roamresearch.com/\">Roam Research\u003C/a>. And with its pricing, came a slew of open-source alternatives of which \u003Ca href=\"https://github.com/org-roam/org-roam\">org-roam\u003C/a> fit my bill finally. The community has left no stone unturned, and thus with org-roam, we have \u003Ca href=\"https://github.com/kaushalmodi/ox-hugo\">ox-hugo\u003C/a> as the transport protocol to web publishing. I chose the \u003Ca href=\"https://github.com/lingxz/er\">Er\u003C/a> theme thinking it’d be pleasing to my readers’ eyes (is it?). The figure below would help you figure out how much I literally mean the phrase “Written and published right from Emacs Org-mode.”:\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/blog_publish_flow.png\" alt=\"Blog publish flow - seamless, isn&#x27;t it?\">\u003C/p>\n\u003Ch2 id=\"first-we-shape-our-tools-thereafter-they-shape-us\">First we shape our tools, thereafter they shape us\u003C/h2>\n\u003Cp>With so much of Emacs bragging, my love towards \u003Cstrong>extensible, configurable and idempotent\u003C/strong> behaviour of tools might be somewhat clear to you. And tada, with that we’d now cover an alternative approach to maintaining dotfiles and provisioning personalized systems really fast.\u003C/p>\n\u003Ch3 id=\"my-dotfiles-setup\">My dotfiles setup\u003C/h3>\n\u003Cp>Dotfiles are no longer fancy, and so is mine. However, I try to cover the configuration files of most of the applicable softwares I use. While having fish, doom, vim, tmux etc in one’s dotfile is a no-brainer, I also keep my backup systems (which includes scripts and their schedules) checked in. Sadly on macOS, there are more mature tools than \u003Ccode>cron\u003C/code> thus breaking Linux compatibility.\u003C/p>\n\u003Cp>You can take a look at my \u003Ca href=\"https://github.com/rounakdatta/dotfiles\">dotfiles\u003C/a>, they are very minimalistic.\u003C/p>\n\u003Ch3 id=\"set-them-up-with-ansible\">Set them up with ansible\u003C/h3>\n\u003Cp>We all used hacky dotfile bootstrapping scripts which had to be maintained, cleaned and generic-ized again and again. However, with ansible, stuff becomes much more easier and streamlined. Idempotency, unit tests, configurability, you name it!\u003C/p>\n\u003Cp>And I use my ansible playbooks not only for symlinking dotfiles, but most importantly for installing, configuring softwares (from source, from release binaries, from app stores, you name it!). Thanks to my password-store setup, I now can plug my passwords into environment variables and put them on a public git repository like this.\u003C/p>\n\u003Cp>You’ll definitely want to look at and make good use of my \u003Ca href=\"https://github.com/rounakdatta/computer.setup\">computer.setup\u003C/a>. If the aforementioned sound quite new (and exciting) to you, let’s start with some gentle Ansible storytelling \u003Ca href=\"https://opensource.com/article/19/9/ansible-documentation-kids-laptops\">here\u003C/a>, followed by some \u003Ca href=\"https://rgoswami.me/posts/prov-dots/\">war stories\u003C/a>. Developers generally make use of this swiss knife Ansible to provision servers (read installing software on auto-pilot) with pre-baked images as well as patches (generally coupled with Terraform) in plain simple YAML.\u003C/p>\n\u003Ch2 id=\"privacy-comes-at-a-price\">Privacy comes at a price\u003C/h2>\n\u003Cp>And we pay the price once by upskilling, or every month by not. I’ve always been skeptical about handing over my passwords to a browser’s internal cloud (i.e. giving it the authority to store passwords on their end in exchange of super-convenience). They suck because not only it’s a browser lock-in, but also they say no to custom password rules/length, multi-password-same-domain and many more novel ideas around password management. \u003Ca href=\"https://www.passwordstore.org/\">pass\u003C/a> is a sweet, simple UNIX-philosophy command-line manager to the rescue. Not only does it tactfully solve the above issues, it also has built a fantastic ecosystem around itself with \u003Ca href=\"https://www.gopass.pw/\">gopass\u003C/a>, \u003Ca href=\"https://github.com/roddhjav/pass-update\">pass-update\u003C/a> to name a few.\u003C/p>\n\u003Cp>With tools like \u003Ca href=\"https://github.com/gopasspw/gopass\">gopass\u003C/a> and \u003Ca href=\"https://github.com/gopasspw/gopassbridge\">gopassbridge\u003C/a>, its a simple, multi-browser-compatible flow of passwords with my setup backed up regularly at a remote private \u003Ca href=\"https://www.dyne.org/software/tomb/\">tombed\u003C/a> git repository.\u003C/p>\n\u003Cp>Did I forget to tell you that the awesome \u003Ca href=\"https://github.com/android-password-store/Android-Password-Store\">Android app\u003C/a> by \u003Ca href=\"https://twitter.com/msfjarvis\">Harsh\u003C/a> has app-level autocomplete and git synchronization support built in?\u003C/p>\n\u003Cp>Did I also forget to tell you that I contributed back to \u003Ca href=\"https://github.com/gopasspw/gopassbridge/pull/177\">gopassbridge\u003C/a> and the \u003Ca href=\"https://github.com/android-password-store/Android-Password-Store/pull/1091\">Android app\u003C/a>?\u003C/p>\n\u003Ch2 id=\"organizing-finance-knowledge\">Organizing finance, knowledge\u003C/h2>\n\u003Cp>All the while we’ve been sharpening the tools we’d work with everyday. Now, with everyday the most organizational pain could be personal finance and knowledge. Yes, we’ve covered another self-hosted software Firefly and the hacks around it in a \u003Ca href=\"/notes/firefly\">different blog post\u003C/a>. And we definitely can do better with GNUCash for other fast-moving investments tracking. Local GNUCash client + remote database is my favourite setup.\u003C/p>\n\u003Cp>When it comes to bookmarks management, its again in general a case of browser lock-in. If not lock-in, it could be poor, hacky synchronization strategies. Ideally, bookmark manager should be an independent software module, and \u003Ca href=\"https://github.com/jarun/buku\">buku\u003C/a> does its job nicely here. buku also has a good webserver (which can preferably run locally on demand) for the data analyst within you!\u003C/p>\n\u003Ch2 id=\"files---the-most-important-ones\">Files - the most important ones\u003C/h2>\n\u003Cp>All files are important, but those which act as bonafide, memoir or personal spreadsheets/documents are important with somewhat greater magnitude. The average person uses Google Drive or the equivalents to not lose visibility of their files. With worryingly powerful full-text search, it’s unclear how much privacy we are trading off for the convenience. And therefore, with some effort, I’ve managed to setup Backbaze B2 as my backup solution for important documents. They provide generous free limits and full revision history and \u003Ca href=\"https://rclone.org/\">rclone\u003C/a> has good support for it. Thus, even though my backups are once-a-day-batch and B2 lacks a good mobile client, the privacy balance has been quite fruitful for me. Backblaze B2 APIs are S3 compatible, and therefore Android clients like \u003Ca href=\"https://play.google.com/store/apps/details?id=dk.tacit.android.foldersync.lite\">FolderSync\u003C/a> make the cut well! ;)\u003C/p>\n\u003Cp>As a closing thought, please feel free to let me know if any of the sections seem not-said-enough. Most of the config/scripts/design in this context is open-source and invites improvement of any kind.\u003C/p>\n\u003Cp>If this post made you think differently today, let us thank the reviewer \u003Ca href=\"https://rounakvyas.me/\">Rounak Vyas\u003C/a> and check out his amazing and witty writings.\u003C/p>",{"headings":258,"localImagePaths":283,"remoteImagePaths":284,"frontmatter":285,"imagePaths":288},[259,262,265,268,271,274,277,280],{"depth":28,"slug":260,"text":261},"whats-in-a-text-editor","What’s in a text editor?",{"depth":32,"slug":263,"text":264},"what-i-type-is-what-you-see","What I type is what you see",{"depth":28,"slug":266,"text":267},"first-we-shape-our-tools-thereafter-they-shape-us","First we shape our tools, thereafter they shape us",{"depth":32,"slug":269,"text":270},"my-dotfiles-setup","My dotfiles setup",{"depth":32,"slug":272,"text":273},"set-them-up-with-ansible","Set them up with ansible",{"depth":28,"slug":275,"text":276},"privacy-comes-at-a-price","Privacy comes at a price",{"depth":28,"slug":278,"text":279},"organizing-finance-knowledge","Organizing finance, knowledge",{"depth":28,"slug":281,"text":282},"files---the-most-important-ones","Files - the most important ones",[],[],{"title":248,"date":286,"tags":287,"draft":19},["Date","2021-01-03T00:00:00.000Z"],[17,251],[],"pagerduty-for-iot",{"id":289,"data":291,"body":298,"filePath":299,"digest":300,"rendered":301},{"title":292,"date":293,"tags":294,"draft":19},"PagerDuty for Things - An interesting IoT project",["Date","2019-10-13T00:00:00.000Z"],[295,152,296,297],"iot","arduino","mobile","An interesting project we worked on being at college was building a PagerDuty-like watchdog for monitoring physical things' state. And the implementation of choice was **liquid level**.\n\n## What's up\n\nThe project is all about an integration effort of an ESP32-connected weight detection machinery to an online service to unlock possibilities like remote monitoring and alerting. To elucidate, think of remotely monitoring your gas cylinder's fuel level and getting alerted whenever the level drops below a custom-defined threshold.\n\nThe project consists of 3 independent network-connected modules:\n\n- **ESP32 Module**: Consists of a weight measurement component (HX711); thereby collects the weight information at regular intervals and publishes them to the remote server through an API.\n- **Server and Data Module**: Responsible for persisting data in a database and processing them upon CRUD requests. Exposes an API to which the ESP32 and the application connect.\n- **Application Modules**: Essentially a client application (Android, iOS, web or whatever) which allows for user input, monitoring and alerting. Provides interfaces for initializing tracking of a new fuel container, setting a custom condition-based alert, displays level information, receives push notifications upon condition being satisfied.\n\n## Digging deep into the hardware architecture\n\n### How do we measure the weight\n\nA **load cell** is a simple piezo-electric device which is designed to measure pressure (or more precisely changes in pressure) through it's *bend ratio*. Upon change of weight of the payload, the bend change is captured in terms of changes in the electrical signal proportionally. Therefore once we calibrate the load cell to find its \"factor\" against a standard weight, any weight within the manufacture range can be quite precisely measured applying simple ratios. Now, **HX711** is a simple amplifier magnifying this electrical input from this load cell thereby making it available to boards to interpret and process it furthur. We experimented with collecting the results on both Arduino Uno and ESP32.\n\n![Connection of load cell -> HX711 -> Arduino](/images/loadcell_hx711_arduino.png)\n\n![Connection of load cell -> HX711 -> ESP32](/images/loadcell_hx711_esp32.png)\n\n```\nHX711 - input:\n- Upper left load cell signal (red wire) => HX711 E- pin\n- Lower left load cell signal (red wire) => HX711 A+ pin\n- Upper right load cell signal (red wire) => HX711 A- pin\n- Lower right load cell signal (red wire) => HX711 E- pin\n\nHX711 - output:\n- HX711 Vcc pin => ESP32 3.3V pin\n- HX711 GND pin => ESP32 GND pin\n- HX711 SCK pin => ESP32 GPIO 2 (pin D9)\n- HX711 DT pin => ESP32 GPIO 5 (pin D8)\n```\n\n## Pinning the hardware setup all together\n\n### Load cell assembly\n\nThe load call would support a weight plate on one of its ends perpendicular to its length; while other end would be fixed to a base.\n\n![Load cell assembly](/images/loadcell_assembly.png)\n\n### Using Arduino Uno as the driver\n\n![First try, when connected to PC, the healthy Arduino didn't respond correctly :(](/images/complete_setup_arduino.jpg)\n\n### Using ESP32 as the driver\n\n![My working setup](/images/complete_setup_esp32.jpg)\n\n![HX711 -> ESP32 connection diagram (WARNING! Please ensure that the 3.3V and GND are connected correctly, they are WRONGLY swapped in the image)](/images/hx711_esp32_connection.png)\n\n## Programming the ESP32\n\nWe write good old C to design the logic of how and what the ESP32 wants to do. Our ESP32 needs individual modules - for obtaining and parsing wireless networks available, sending and receiving data over BLE (Bluetooh Low Energy) to the client, connecting to a wireless network when commanded with credentials, utilizing EEPROM to remember actions even in sleep and finally making `GET` and `POST` requests to the remote service. And extra care has to be taken to prevent the low-key machine from getting overwhelmed (maintaining wireless and Bluetooth connections at the same time is not less CPU intensive!).\n\n## Setting up the remote service, database and the data\n\nThe remote data-keeper-and-processor is a tiny, light Golang service which organizes all the data for registered devices, scheduled notifications, liquid levels etc and is responsible for pushing the notifications down to the clients, thus completing the chain. There is also small share of intelligence built into the system to predict device downtimes (poor network), regressing upon the time-vs-level curve to detect accidental scenarios.\n\n## The app in user's hand\n\nThe application was built as hybrid-platform Ionic framework-based. With TypeScript magic, we are able to seamlessly allow the user find and connect to a new ESP32 device nearby, help the ESP32 get connected to the internet through BLE-talking and finally peace-of-mind monitoring remotely. Users are allowed to set multiple custom notifications based on levels.\n\n![Mock screens for the application](/images/application_mock.png)\n\n## Furthur discussions\n\n### How do you set up a new gas cylinder device?\n\nTo start monitoring the newly fitted ESP32-connected gas cylinder, we need to help that ESP32 connect the network (obviously through WiFi). To help it connect to WiFi, we have one obvious option:\n\n- ~~Hardcode the WiFi SSID and password into the ESP32 source code (stupid)~~\n- Send it over some medium from the client to the ESP32\n\nAnd, to accomplish this, we use Bluetooth Low Energy (BLE) to establish the connectivity between the client (say the phone here) and ESP32. So we come quite closer to the ESP32 (maximum range of BLE is 100m). This is a beautiful part in itself as the ESP32 then helps us see which all wireless networks it can see. And then we choose the network and send the SSID and password serially to the ESP32 which should next remember them in its flash memory (some boilerplate code [here](https://gist.github.com/rounakdatta/345964a13fe3b3b77fab2a11eaaaa5ab)). So, the ESP32 now can connect the network.\n\n### What's the logic of level-based alerting?\n\nThe app provides the interface to input a custom level at which the user wants to be alerted - could be say 75% or 33% or 1%. We need to address multiple challenges here:\n\n- A user might have set up multiple gas cylinders against a single account, and we'd have to send the notification of each of the owned devices to the same phone\n- How frequently should the modules poll amongst each other? How closely should the ESP32 update the remote server about the weight measured? How soon should the app check back from the server whether it has crossed the threshold or not?\n- Based on this frequency of polling, how do we ensure that the level doesn't get missed from being recorded (say the level falls too rapidly), also how do we maintain a state of whether a custom alert notification has been successfully delivered or not?\n\n### What are some possibilities and optimizations to look at?\n\n- Potentially building a logic to make sure the server and ESP32 *learns* how frequently to poll for data. This helps optimize scale to a judicious API callout.\n- How do we handle reads (load cell or HX711 misbehaving) or stale data (ESP32 offline)?\n- Building a marketplace around the concept, what if the app could automatically book a refill from a local vendor!","src/content/notes/pagerduty-for-iot.md","df273463572b8389",{"html":302,"metadata":303},"\u003Cp>An interesting project we worked on being at college was building a PagerDuty-like watchdog for monitoring physical things’ state. And the implementation of choice was \u003Cstrong>liquid level\u003C/strong>.\u003C/p>\n\u003Ch2 id=\"whats-up\">What’s up\u003C/h2>\n\u003Cp>The project is all about an integration effort of an ESP32-connected weight detection machinery to an online service to unlock possibilities like remote monitoring and alerting. To elucidate, think of remotely monitoring your gas cylinder’s fuel level and getting alerted whenever the level drops below a custom-defined threshold.\u003C/p>\n\u003Cp>The project consists of 3 independent network-connected modules:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cstrong>ESP32 Module\u003C/strong>: Consists of a weight measurement component (HX711); thereby collects the weight information at regular intervals and publishes them to the remote server through an API.\u003C/li>\n\u003Cli>\u003Cstrong>Server and Data Module\u003C/strong>: Responsible for persisting data in a database and processing them upon CRUD requests. Exposes an API to which the ESP32 and the application connect.\u003C/li>\n\u003Cli>\u003Cstrong>Application Modules\u003C/strong>: Essentially a client application (Android, iOS, web or whatever) which allows for user input, monitoring and alerting. Provides interfaces for initializing tracking of a new fuel container, setting a custom condition-based alert, displays level information, receives push notifications upon condition being satisfied.\u003C/li>\n\u003C/ul>\n\u003Ch2 id=\"digging-deep-into-the-hardware-architecture\">Digging deep into the hardware architecture\u003C/h2>\n\u003Ch3 id=\"how-do-we-measure-the-weight\">How do we measure the weight\u003C/h3>\n\u003Cp>A \u003Cstrong>load cell\u003C/strong> is a simple piezo-electric device which is designed to measure pressure (or more precisely changes in pressure) through it’s \u003Cem>bend ratio\u003C/em>. Upon change of weight of the payload, the bend change is captured in terms of changes in the electrical signal proportionally. Therefore once we calibrate the load cell to find its “factor” against a standard weight, any weight within the manufacture range can be quite precisely measured applying simple ratios. Now, \u003Cstrong>HX711\u003C/strong> is a simple amplifier magnifying this electrical input from this load cell thereby making it available to boards to interpret and process it furthur. We experimented with collecting the results on both Arduino Uno and ESP32.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/loadcell_hx711_arduino.png\" alt=\"Connection of load cell -> HX711 -> Arduino\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/loadcell_hx711_esp32.png\" alt=\"Connection of load cell -> HX711 -> ESP32\">\u003C/p>\n\u003Cpre class=\"astro-code github-light\" style=\"background-color:#fff;color:#24292e; overflow-x: auto; white-space: pre-wrap; word-wrap: break-word;\" tabindex=\"0\" data-language=\"plaintext\">\u003Ccode>\u003Cspan class=\"line\">\u003Cspan>HX711 - input:\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- Upper left load cell signal (red wire) => HX711 E- pin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- Lower left load cell signal (red wire) => HX711 A+ pin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- Upper right load cell signal (red wire) => HX711 A- pin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- Lower right load cell signal (red wire) => HX711 E- pin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>HX711 - output:\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- HX711 Vcc pin => ESP32 3.3V pin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- HX711 GND pin => ESP32 GND pin\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- HX711 SCK pin => ESP32 GPIO 2 (pin D9)\u003C/span>\u003C/span>\n\u003Cspan class=\"line\">\u003Cspan>- HX711 DT pin => ESP32 GPIO 5 (pin D8)\u003C/span>\u003C/span>\u003C/code>\u003C/pre>\n\u003Ch2 id=\"pinning-the-hardware-setup-all-together\">Pinning the hardware setup all together\u003C/h2>\n\u003Ch3 id=\"load-cell-assembly\">Load cell assembly\u003C/h3>\n\u003Cp>The load call would support a weight plate on one of its ends perpendicular to its length; while other end would be fixed to a base.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/loadcell_assembly.png\" alt=\"Load cell assembly\">\u003C/p>\n\u003Ch3 id=\"using-arduino-uno-as-the-driver\">Using Arduino Uno as the driver\u003C/h3>\n\u003Cp>\u003Cimg src=\"/images/complete_setup_arduino.jpg\" alt=\"First try, when connected to PC, the healthy Arduino didn&#x27;t respond correctly :(\">\u003C/p>\n\u003Ch3 id=\"using-esp32-as-the-driver\">Using ESP32 as the driver\u003C/h3>\n\u003Cp>\u003Cimg src=\"/images/complete_setup_esp32.jpg\" alt=\"My working setup\">\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/hx711_esp32_connection.png\" alt=\"HX711 -> ESP32 connection diagram (WARNING! Please ensure that the 3.3V and GND are connected correctly, they are WRONGLY swapped in the image)\">\u003C/p>\n\u003Ch2 id=\"programming-the-esp32\">Programming the ESP32\u003C/h2>\n\u003Cp>We write good old C to design the logic of how and what the ESP32 wants to do. Our ESP32 needs individual modules - for obtaining and parsing wireless networks available, sending and receiving data over BLE (Bluetooh Low Energy) to the client, connecting to a wireless network when commanded with credentials, utilizing EEPROM to remember actions even in sleep and finally making \u003Ccode>GET\u003C/code> and \u003Ccode>POST\u003C/code> requests to the remote service. And extra care has to be taken to prevent the low-key machine from getting overwhelmed (maintaining wireless and Bluetooth connections at the same time is not less CPU intensive!).\u003C/p>\n\u003Ch2 id=\"setting-up-the-remote-service-database-and-the-data\">Setting up the remote service, database and the data\u003C/h2>\n\u003Cp>The remote data-keeper-and-processor is a tiny, light Golang service which organizes all the data for registered devices, scheduled notifications, liquid levels etc and is responsible for pushing the notifications down to the clients, thus completing the chain. There is also small share of intelligence built into the system to predict device downtimes (poor network), regressing upon the time-vs-level curve to detect accidental scenarios.\u003C/p>\n\u003Ch2 id=\"the-app-in-users-hand\">The app in user’s hand\u003C/h2>\n\u003Cp>The application was built as hybrid-platform Ionic framework-based. With TypeScript magic, we are able to seamlessly allow the user find and connect to a new ESP32 device nearby, help the ESP32 get connected to the internet through BLE-talking and finally peace-of-mind monitoring remotely. Users are allowed to set multiple custom notifications based on levels.\u003C/p>\n\u003Cp>\u003Cimg src=\"/images/application_mock.png\" alt=\"Mock screens for the application\">\u003C/p>\n\u003Ch2 id=\"furthur-discussions\">Furthur discussions\u003C/h2>\n\u003Ch3 id=\"how-do-you-set-up-a-new-gas-cylinder-device\">How do you set up a new gas cylinder device?\u003C/h3>\n\u003Cp>To start monitoring the newly fitted ESP32-connected gas cylinder, we need to help that ESP32 connect the network (obviously through WiFi). To help it connect to WiFi, we have one obvious option:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cdel>Hardcode the WiFi SSID and password into the ESP32 source code (stupid)\u003C/del>\u003C/li>\n\u003Cli>Send it over some medium from the client to the ESP32\u003C/li>\n\u003C/ul>\n\u003Cp>And, to accomplish this, we use Bluetooth Low Energy (BLE) to establish the connectivity between the client (say the phone here) and ESP32. So we come quite closer to the ESP32 (maximum range of BLE is 100m). This is a beautiful part in itself as the ESP32 then helps us see which all wireless networks it can see. And then we choose the network and send the SSID and password serially to the ESP32 which should next remember them in its flash memory (some boilerplate code \u003Ca href=\"https://gist.github.com/rounakdatta/345964a13fe3b3b77fab2a11eaaaa5ab\">here\u003C/a>). So, the ESP32 now can connect the network.\u003C/p>\n\u003Ch3 id=\"whats-the-logic-of-level-based-alerting\">What’s the logic of level-based alerting?\u003C/h3>\n\u003Cp>The app provides the interface to input a custom level at which the user wants to be alerted - could be say 75% or 33% or 1%. We need to address multiple challenges here:\u003C/p>\n\u003Cul>\n\u003Cli>A user might have set up multiple gas cylinders against a single account, and we’d have to send the notification of each of the owned devices to the same phone\u003C/li>\n\u003Cli>How frequently should the modules poll amongst each other? How closely should the ESP32 update the remote server about the weight measured? How soon should the app check back from the server whether it has crossed the threshold or not?\u003C/li>\n\u003Cli>Based on this frequency of polling, how do we ensure that the level doesn’t get missed from being recorded (say the level falls too rapidly), also how do we maintain a state of whether a custom alert notification has been successfully delivered or not?\u003C/li>\n\u003C/ul>\n\u003Ch3 id=\"what-are-some-possibilities-and-optimizations-to-look-at\">What are some possibilities and optimizations to look at?\u003C/h3>\n\u003Cul>\n\u003Cli>Potentially building a logic to make sure the server and ESP32 \u003Cem>learns\u003C/em> how frequently to poll for data. This helps optimize scale to a judicious API callout.\u003C/li>\n\u003Cli>How do we handle reads (load cell or HX711 misbehaving) or stale data (ESP32 offline)?\u003C/li>\n\u003Cli>Building a marketplace around the concept, what if the app could automatically book a refill from a local vendor!\u003C/li>\n\u003C/ul>",{"headings":304,"localImagePaths":347,"remoteImagePaths":348,"frontmatter":349,"imagePaths":352},[305,308,311,314,317,320,323,326,329,332,335,338,341,344],{"depth":28,"slug":306,"text":307},"whats-up","What’s up",{"depth":28,"slug":309,"text":310},"digging-deep-into-the-hardware-architecture","Digging deep into the hardware architecture",{"depth":32,"slug":312,"text":313},"how-do-we-measure-the-weight","How do we measure the weight",{"depth":28,"slug":315,"text":316},"pinning-the-hardware-setup-all-together","Pinning the hardware setup all together",{"depth":32,"slug":318,"text":319},"load-cell-assembly","Load cell assembly",{"depth":32,"slug":321,"text":322},"using-arduino-uno-as-the-driver","Using Arduino Uno as the driver",{"depth":32,"slug":324,"text":325},"using-esp32-as-the-driver","Using ESP32 as the driver",{"depth":28,"slug":327,"text":328},"programming-the-esp32","Programming the ESP32",{"depth":28,"slug":330,"text":331},"setting-up-the-remote-service-database-and-the-data","Setting up the remote service, database and the data",{"depth":28,"slug":333,"text":334},"the-app-in-users-hand","The app in user’s hand",{"depth":28,"slug":336,"text":337},"furthur-discussions","Furthur discussions",{"depth":32,"slug":339,"text":340},"how-do-you-set-up-a-new-gas-cylinder-device","How do you set up a new gas cylinder device?",{"depth":32,"slug":342,"text":343},"whats-the-logic-of-level-based-alerting","What’s the logic of level-based alerting?",{"depth":32,"slug":345,"text":346},"what-are-some-possibilities-and-optimizations-to-look-at","What are some possibilities and optimizations to look at?",[],[],{"title":292,"date":350,"tags":351,"draft":19},["Date","2019-10-13T00:00:00.000Z"],[295,152,296,297],[],"walking-the-highlands",{"id":353,"data":355,"body":359,"filePath":360,"digest":361,"rendered":362},{"title":356,"date":357,"tags":358,"draft":19},"A love letter to the Highlands",["Date","2025-07-12T00:00:00.000Z"],[110],"\u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/59b29b04-a3de-436e-9d71-ea5b65ad4224_3472x4624.jpg\n\" />\n    \u003Cfigcaption>You never walk alone\u003C/figcaption>\n  \u003C/figure>\n\nIt’s another morning, and there’s a lot of frenzy happening around the world. But Mr Mike is out to walk his dog. So is the Bennett couple, albeit hurried, determined to finish their loop before noon.\n\nThousands of walkers choose the West Highland Way every year - some in an ambitious number of days, some a section of it, some on a cyle, some in a big group, some for the umpteenth time, some with tents, and some just hoping for the best. I put together the first and the last and called it a vacation, a rather adventurous one.\n\nThe Highlands comprise more than half of Scotland, and people live slow, simple lives there. You have abundance of nature - lochs (lakes), glens (valleys) and bens (mountains), but non-abundance of luxury. And that’s what makes it special. West Highland Way (WHW) is a long walking route to give one a taste of life in the Highlands. The route is *very* well marked and not technically difficult. It runs from Glasgow all the way to Fort William. The A82 road runs approximately parallel to it, and gives you the equivalent driving experience through the Highlands. Starting from Milngavie (edge of Glasgow), the initial dozens of kilometers can paint a very rosy picture if weather’s on your side - you get gentle roads with tons of greenery and picturesque views. You pass by meadows, ranches, forests, rivers, small towns - all very dreamy. So I set on to walk the WHW in four days (6—7 days is the recommendation), with hostels booked at ambitiously spaced stops along the route.\n\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/a33678ea-826d-488f-a6ba-85cbb5c9392d_4624x3472.jpg\" />\n    \u003Cfigcaption>It’s all green and pretty until…\u003C/figcaption>\n  \u003C/figure>\n\nI think we are still getting used to the daily rapid changes in geopolitics, technology and all. Except Scottish people, they’ve been forever seeing their weather change by the hour, not days. Your gear has to be a single stone that hits multiple birds. If the past hour was about walking on a nicely paved road with the sun starting to hurt, this hour is about rushing by a grassland - all open and rough, with a light rain and not-so-light wind. And the next hour would be about finding yourself climbing up *Conic Hill* in the bright sun, with your heart rate climbing up even faster. A place named Drymen is where we got the wettest, just saying. After all that toiling through the woods, rocky climbs, you might suddenly find yourself on the shores of the calm Loch Lomond to find people setting up camps, grilling food and the children running around. The vastness of the seas releases all the fatigue off your legs. Yes, [Right to Roam](https://www.outdooraccess-scotland.scot/practical-guide-all/camping) is a thing in Scotland!\n\n\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/89a269d0-f00a-4517-af56-49236b62a304_4624x3472.jpg\" />\n  \u003C/figure>\n\nI mentioned the phrase non-abundance of luxury in the Highlands - there’s usually no plan B for missing the last bus, damaging your hiking shoes en route, not having GPX files saved offline, bringing more weight than required, not carrying the right food packets, skipping water refills at the right points and so on. Well, the plan B is of course trading off suffering with expensive alternatives. And that’s why even though it’s always humbling to subscribe to uncertainty, you come out strong. And all the curveballs thrown at you become the stories you tell people with awe afterwards.\n\nBut the reality is not as rough as I put it - instead nature is quite forgiving, you always find great friends on the way, and get help when you’re least expecting it. It is also magical how we ourselves get creative pro max when under surprise test, and this pattern repeats and repeats.\n\n\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/8a90c9ba-de10-4708-ad06-89b7d76b267f_4624x3472.jpg\" />\n    \u003Cfigcaption>Green field or cold steel rail? Choose both\u003C/figcaption>\n  \u003C/figure>\n\nThe magic often lies in sprinkling some uncertainty onto your itinerary!\n\n- The zinc oxide tape which I packed for blister protection turned out to be my best hope at holding on to my hiking shoe’s bottom sole a bit longer. While this disrupted my plan, it opened up other moments of serendipity.\n\n- A red Taylor Swift t-shirt I was wearing turned a midnight bathroom break into an hour-long conversation.\n\n- Meeting an ex-TSMC employee at a hostel in Fort William taught me so much on chip-making, China-Taiwan and globalization.\n  - Little did I know that the [iPhone 6s CPU was a public A/B experiment](https://www.tomshardware.com/news/iphone-6s-a9-samsung-vs-tsmc,30306.html) between Samsung and TSMC!\n  - What Huawei and Samsung call 5nm is not truly what TSMC calls 5nm. The formers are technologically way behind. And that leads to [juicy espionage stories](https://www.theregister.com/2015/08/25/tsmc_samsung_espionage_judgment/).\n  - China contains multitudes, and beyond all its mischiefs, the West has many things to learn from it.\n  - Taking an indefinite career break & setting out to travel for 4-6 months without a plan can be very much a way of life.\n\n- A wait at a bus stand (Scottish bus schedules can be erratic on weekends) can become an extraordinary opportunity to learn global culture. I met a Canadian woman who set off to hike the Highlands on her extra days in the country after attending a Scottish wedding. I also met an Australian couple who enlightened me that the Perth in Scotland is the *original* Perth. There was a German girl in the group who *inveriably* kept confusing between Inversnaid, Inverarnan, Inverlochy and Inverness. Heck, we crossed paths twice in three days - small world!\n\n- An evening in Crianlarich Youth Hostel, I met a middle-aged man who loved his cables and maps and diaries and magnifying glass - unlike any other man I’d met. He was a complete nerd who was lost in his world, and kept himself busy all throughout - the cute way. He drove his car all the way from Peak District to Crianlarich with the boot filled with five big cardboard boxes - which he promptly unloaded beside his hostel bed. There were at least two power extension boards, and five things getting charged - all seemingly ancient devices. Swiftly he’d set out to the community kitchen to chop, peel and boil some healthy food for himself, followed by some fruits and countless cups of coffee in between. While food would be cooking, he’d open up his meticulous notes on diaries (with pages almost coming off), his paper maps, and explain to us his upcoming itinerary. He would talk about his hunt for maps of the Highlands which are precisely to scale and not settling for online maps. By the strike of 10 O’clock, he’d start packing his countless items from the common area and head back to bed. It’s a real joy to see someone who has found their [purpose and way of life](https://ibb.co/SwDJywrY), disregarding any acceptance or rejection.\n\n- A long walk on a rainy day in Glencoe, I met people both happy with energy and downcast. There was a family from Punjab, the man being a lawyer at the High Court of Delhi - that ended up being my only encounter with someone Indian through the Highlands. And then another man whose motorbike was unfortunately stolen that day, and all he was trying was to find some mental ground to get back up.\n\n- On another stay in Fort William, I met a German girl who drove her motorbike all the way from Germany. She’d talk about how her work life at medical technology industry would be, how her father helped debug a trouble with her motorbike’s gear system over video call and how Bangalore’s Whitefield is the only place her family has ever been to in India. We wished we could keep talking forever, but then the roads were waiting for us.\n\n\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/a80e1bb0-4e39-4957-a229-08bc39c11ceb_4451x3920.jpg\" />\n    \u003Cfigcaption>ZnOom out to ZnOom in\u003C/figcaption>\n  \u003C/figure>\n\nI think I kept you wondering whether I was travelling solo. I indeed was, and aforementioned stories the prime reasons I love my solo trips! Having that freedom to stop, look around, cancel that plan, take that other path, talk to that unknown stranger has its irreplaceable pleasures.\n\nI think I also kept you wondering whether I was successful in finishing my West Highland Way route. I wasn’t! Of the total 154 kms, I only did ~half of it, that too occasionally going off the official route. Only the first day went as planned, the remainder was a mix of taking the public transport and walking. The last day’s walk in Fort William was particularly enjoyable, I had the company of [non-stop Scottish rains](https://birlinn.co.uk/product/the-little-book-of-scottish-rain/), [Ben and David](https://www.acquired.fm/episodes/epic-systems-mychart) all throughout. The last stretch of walk along the Caol Beach was the cherry on top - it had one of the most beautiful pathways I’ve ever walked on.\n\n\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/32c50e9a-03fc-4eec-b2d2-31e4537312e5_3344x3605.jpg\" />\n  \u003C/figure>\n\nDear Highlands, I arrived a stranger and left lovestruck. Until we meet again…","src/content/notes/walking-the-highlands.md","e3a575be137a398d",{"html":363,"metadata":364},"\u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/59b29b04-a3de-436e-9d71-ea5b65ad4224_3472x4624.jpg\n\">\n    \u003Cfigcaption>You never walk alone\u003C/figcaption>\n  \u003C/figure>\n\u003Cp>It’s another morning, and there’s a lot of frenzy happening around the world. But Mr Mike is out to walk his dog. So is the Bennett couple, albeit hurried, determined to finish their loop before noon.\u003C/p>\n\u003Cp>Thousands of walkers choose the West Highland Way every year - some in an ambitious number of days, some a section of it, some on a cyle, some in a big group, some for the umpteenth time, some with tents, and some just hoping for the best. I put together the first and the last and called it a vacation, a rather adventurous one.\u003C/p>\n\u003Cp>The Highlands comprise more than half of Scotland, and people live slow, simple lives there. You have abundance of nature - lochs (lakes), glens (valleys) and bens (mountains), but non-abundance of luxury. And that’s what makes it special. West Highland Way (WHW) is a long walking route to give one a taste of life in the Highlands. The route is \u003Cem>very\u003C/em> well marked and not technically difficult. It runs from Glasgow all the way to Fort William. The A82 road runs approximately parallel to it, and gives you the equivalent driving experience through the Highlands. Starting from Milngavie (edge of Glasgow), the initial dozens of kilometers can paint a very rosy picture if weather’s on your side - you get gentle roads with tons of greenery and picturesque views. You pass by meadows, ranches, forests, rivers, small towns - all very dreamy. So I set on to walk the WHW in four days (6—7 days is the recommendation), with hostels booked at ambitiously spaced stops along the route.\u003C/p>\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/a33678ea-826d-488f-a6ba-85cbb5c9392d_4624x3472.jpg\">\n    \u003Cfigcaption>It’s all green and pretty until…\u003C/figcaption>\n  \u003C/figure>\n\u003Cp>I think we are still getting used to the daily rapid changes in geopolitics, technology and all. Except Scottish people, they’ve been forever seeing their weather change by the hour, not days. Your gear has to be a single stone that hits multiple birds. If the past hour was about walking on a nicely paved road with the sun starting to hurt, this hour is about rushing by a grassland - all open and rough, with a light rain and not-so-light wind. And the next hour would be about finding yourself climbing up \u003Cem>Conic Hill\u003C/em> in the bright sun, with your heart rate climbing up even faster. A place named Drymen is where we got the wettest, just saying. After all that toiling through the woods, rocky climbs, you might suddenly find yourself on the shores of the calm Loch Lomond to find people setting up camps, grilling food and the children running around. The vastness of the seas releases all the fatigue off your legs. Yes, \u003Ca href=\"https://www.outdooraccess-scotland.scot/practical-guide-all/camping\">Right to Roam\u003C/a> is a thing in Scotland!\u003C/p>\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/89a269d0-f00a-4517-af56-49236b62a304_4624x3472.jpg\">\n  \u003C/figure>\n\u003Cp>I mentioned the phrase non-abundance of luxury in the Highlands - there’s usually no plan B for missing the last bus, damaging your hiking shoes en route, not having GPX files saved offline, bringing more weight than required, not carrying the right food packets, skipping water refills at the right points and so on. Well, the plan B is of course trading off suffering with expensive alternatives. And that’s why even though it’s always humbling to subscribe to uncertainty, you come out strong. And all the curveballs thrown at you become the stories you tell people with awe afterwards.\u003C/p>\n\u003Cp>But the reality is not as rough as I put it - instead nature is quite forgiving, you always find great friends on the way, and get help when you’re least expecting it. It is also magical how we ourselves get creative pro max when under surprise test, and this pattern repeats and repeats.\u003C/p>\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/8a90c9ba-de10-4708-ad06-89b7d76b267f_4624x3472.jpg\">\n    \u003Cfigcaption>Green field or cold steel rail? Choose both\u003C/figcaption>\n  \u003C/figure>\n\u003Cp>The magic often lies in sprinkling some uncertainty onto your itinerary!\u003C/p>\n\u003Cul>\n\u003Cli>\n\u003Cp>The zinc oxide tape which I packed for blister protection turned out to be my best hope at holding on to my hiking shoe’s bottom sole a bit longer. While this disrupted my plan, it opened up other moments of serendipity.\u003C/p>\n\u003C/li>\n\u003Cli>\n\u003Cp>A red Taylor Swift t-shirt I was wearing turned a midnight bathroom break into an hour-long conversation.\u003C/p>\n\u003C/li>\n\u003Cli>\n\u003Cp>Meeting an ex-TSMC employee at a hostel in Fort William taught me so much on chip-making, China-Taiwan and globalization.\u003C/p>\n\u003Cul>\n\u003Cli>Little did I know that the \u003Ca href=\"https://www.tomshardware.com/news/iphone-6s-a9-samsung-vs-tsmc,30306.html\">iPhone 6s CPU was a public A/B experiment\u003C/a> between Samsung and TSMC!\u003C/li>\n\u003Cli>What Huawei and Samsung call 5nm is not truly what TSMC calls 5nm. The formers are technologically way behind. And that leads to \u003Ca href=\"https://www.theregister.com/2015/08/25/tsmc_samsung_espionage_judgment/\">juicy espionage stories\u003C/a>.\u003C/li>\n\u003Cli>China contains multitudes, and beyond all its mischiefs, the West has many things to learn from it.\u003C/li>\n\u003Cli>Taking an indefinite career break &#x26; setting out to travel for 4-6 months without a plan can be very much a way of life.\u003C/li>\n\u003C/ul>\n\u003C/li>\n\u003Cli>\n\u003Cp>A wait at a bus stand (Scottish bus schedules can be erratic on weekends) can become an extraordinary opportunity to learn global culture. I met a Canadian woman who set off to hike the Highlands on her extra days in the country after attending a Scottish wedding. I also met an Australian couple who enlightened me that the Perth in Scotland is the \u003Cem>original\u003C/em> Perth. There was a German girl in the group who \u003Cem>inveriably\u003C/em> kept confusing between Inversnaid, Inverarnan, Inverlochy and Inverness. Heck, we crossed paths twice in three days - small world!\u003C/p>\n\u003C/li>\n\u003Cli>\n\u003Cp>An evening in Crianlarich Youth Hostel, I met a middle-aged man who loved his cables and maps and diaries and magnifying glass - unlike any other man I’d met. He was a complete nerd who was lost in his world, and kept himself busy all throughout - the cute way. He drove his car all the way from Peak District to Crianlarich with the boot filled with five big cardboard boxes - which he promptly unloaded beside his hostel bed. There were at least two power extension boards, and five things getting charged - all seemingly ancient devices. Swiftly he’d set out to the community kitchen to chop, peel and boil some healthy food for himself, followed by some fruits and countless cups of coffee in between. While food would be cooking, he’d open up his meticulous notes on diaries (with pages almost coming off), his paper maps, and explain to us his upcoming itinerary. He would talk about his hunt for maps of the Highlands which are precisely to scale and not settling for online maps. By the strike of 10 O’clock, he’d start packing his countless items from the common area and head back to bed. It’s a real joy to see someone who has found their \u003Ca href=\"https://ibb.co/SwDJywrY\">purpose and way of life\u003C/a>, disregarding any acceptance or rejection.\u003C/p>\n\u003C/li>\n\u003Cli>\n\u003Cp>A long walk on a rainy day in Glencoe, I met people both happy with energy and downcast. There was a family from Punjab, the man being a lawyer at the High Court of Delhi - that ended up being my only encounter with someone Indian through the Highlands. And then another man whose motorbike was unfortunately stolen that day, and all he was trying was to find some mental ground to get back up.\u003C/p>\n\u003C/li>\n\u003Cli>\n\u003Cp>On another stay in Fort William, I met a German girl who drove her motorbike all the way from Germany. She’d talk about how her work life at medical technology industry would be, how her father helped debug a trouble with her motorbike’s gear system over video call and how Bangalore’s Whitefield is the only place her family has ever been to in India. We wished we could keep talking forever, but then the roads were waiting for us.\u003C/p>\n\u003Cfigure>\n  \u003Cimg src=\"/images/walking_the_highlands/a80e1bb0-4e39-4957-a229-08bc39c11ceb_4451x3920.jpg\">\n  \u003Cfigcaption>ZnOom out to ZnOom in\u003C/figcaption>\n\u003C/figure>\n\u003C/li>\n\u003C/ul>\n\u003Cp>I think I kept you wondering whether I was travelling solo. I indeed was, and aforementioned stories the prime reasons I love my solo trips! Having that freedom to stop, look around, cancel that plan, take that other path, talk to that unknown stranger has its irreplaceable pleasures.\u003C/p>\n\u003Cp>I think I also kept you wondering whether I was successful in finishing my West Highland Way route. I wasn’t! Of the total 154 kms, I only did ~half of it, that too occasionally going off the official route. Only the first day went as planned, the remainder was a mix of taking the public transport and walking. The last day’s walk in Fort William was particularly enjoyable, I had the company of \u003Ca href=\"https://birlinn.co.uk/product/the-little-book-of-scottish-rain/\">non-stop Scottish rains\u003C/a>, \u003Ca href=\"https://www.acquired.fm/episodes/epic-systems-mychart\">Ben and David\u003C/a> all throughout. The last stretch of walk along the Caol Beach was the cherry on top - it had one of the most beautiful pathways I’ve ever walked on.\u003C/p>\n  \u003Cfigure>\n    \u003Cimg src=\"/images/walking_the_highlands/32c50e9a-03fc-4eec-b2d2-31e4537312e5_3344x3605.jpg\">\n  \u003C/figure>\n\u003Cp>Dear Highlands, I arrived a stranger and left lovestruck. Until we meet again…\u003C/p>",{"headings":365,"localImagePaths":366,"remoteImagePaths":367,"frontmatter":368,"imagePaths":371},[],[],[],{"title":356,"date":369,"tags":370,"draft":19},["Date","2025-07-12T00:00:00.000Z"],[110],[],"projects",["Map",374,375,395,396,204,412,430,431],"dotfiles",{"id":374,"data":376,"body":383,"filePath":384,"digest":385,"rendered":386},{"title":374,"github":377,"logo":378,"tags":379,"featured":382,"special":19,"order":32},"https://github.com/rounakdatta/dotfiles","/images/projects/dotfiles_logo.jpg",[380,381],"automation","productivity",true,"I was first introduced to the world of Infrastructure-as-Code through Terraform in 2020. I was introduced to functional programming in 2021. Nix marries the two concepts, and asks you to never look back. My dotfiles repository is my way of telling my operating system what all needs to be installed and configured on my computer - personal or otherwise.","src/content/projects/dotfiles.md","6fcf667aa73f63b0",{"html":387,"metadata":388},"\u003Cp>I was first introduced to the world of Infrastructure-as-Code through Terraform in 2020. I was introduced to functional programming in 2021. Nix marries the two concepts, and asks you to never look back. My dotfiles repository is my way of telling my operating system what all needs to be installed and configured on my computer - personal or otherwise.\u003C/p>",{"headings":389,"localImagePaths":390,"remoteImagePaths":391,"frontmatter":392,"imagePaths":394},[],[],[],{"title":374,"github":377,"logo":378,"tags":393,"featured":382,"order":32},[380,381],[],"fitness-project",{"id":395,"data":397,"filePath":402,"digest":403,"rendered":404},{"title":398,"tags":399,"featured":382,"special":382,"internalUrl":400,"order":401},"The Fitness Project",[],"/fitness",1,"src/content/projects/fitness-project.md","e980d87dfc608f78",{"html":405,"metadata":406},"",{"headings":407,"localImagePaths":408,"remoteImagePaths":409,"frontmatter":410,"imagePaths":411},[],[],[],{"title":398,"featured":382,"special":382,"internalUrl":400,"order":401},[],{"id":204,"data":413,"body":418,"filePath":419,"digest":420,"rendered":421},{"title":414,"github":415,"logo":416,"tags":417,"featured":382,"special":19,"order":28},"homelab.setup","https://github.com/rounakdatta/homelab.setup","/images/projects/homelab_logo.png",[380,381],"\"Free as in ~beer~ freedom\" software used to be a thing, now it's mostly a dream. With self-hosting software on your own hardware beside your couch, you get to live that dream. It's a garden that keeps gardening itself.","src/content/projects/homelab.md","9606814e0c939560",{"html":422,"metadata":423},"\u003Cp>“Free as in \u003Cdel>beer\u003C/del> freedom” software used to be a thing, now it’s mostly a dream. With self-hosting software on your own hardware beside your couch, you get to live that dream. It’s a garden that keeps gardening itself.\u003C/p>",{"headings":424,"localImagePaths":425,"remoteImagePaths":426,"frontmatter":427,"imagePaths":429},[],[],[],{"title":414,"github":415,"logo":416,"tags":428,"featured":382,"order":28},[380,381],[],"reading-project",{"id":430,"data":432,"filePath":437,"digest":438,"rendered":439},{"title":433,"tags":434,"featured":382,"special":382,"internalUrl":435,"order":436},"The Reading Project",[],"/reading",0,"src/content/projects/reading-project.md","54906f28a4cc7266",{"html":405,"metadata":440},{"headings":441,"localImagePaths":442,"remoteImagePaths":443,"frontmatter":444,"imagePaths":445},[],[],[],{"title":433,"featured":382,"special":382,"internalUrl":435,"order":436},[],"photoAlbums",["Map",448,449],"rajasthan-trip-2025",{"id":448,"data":450,"filePath":484,"digest":485,"rendered":486},{"title":451,"subtitle":452,"order":436,"photos":453},"Rajasthan Extra Time 2025","Weddings, vibes & more",[454,457,460,463,466,469,472,475,478,481],{"src":455,"caption":456},"/images/rajasthan_2025/IMG_20251201_173831.jpg","Easing into the evening",{"src":458,"caption":459},"/images/rajasthan_2025/IMG_20251206_165707.jpg","City Palace, Jaipur",{"src":461,"caption":462},"/images/rajasthan_2025/IMG_20251206_175227.jpg","City Palace, Udaipur",{"src":464,"caption":465},"/images/rajasthan_2025/IMG_20251207_143107.jpg","Rough, raw & beautiful",{"src":467,"caption":468},"/images/rajasthan_2025/IMG_20251207_171441.jpg","OCaml isn't the only thing I love",{"src":470,"caption":471},"/images/rajasthan_2025/IMG_20251209_085111.jpg","Seizing Fateh Sagar Lake early in the day",{"src":473,"caption":474},"/images/rajasthan_2025/IMG_2460.jpg","The many colours of Rajasthan",{"src":476,"caption":477},"/images/rajasthan_2025/PXL_20251206_123704425.jpg","Windows never lie",{"src":479,"caption":480},"/images/rajasthan_2025/IMG-20251202-WA0242.jpg","The Great Wall of.. Jaipur",{"src":482,"caption":483},"/images/rajasthan_2025/IMG_20251129_161855.jpg","Truck de India","src/content/photos/rajasthan-trip-2025.md","953ee97d1ae745a4",{"html":405,"metadata":487},{"headings":488,"localImagePaths":489,"remoteImagePaths":490,"frontmatter":491,"imagePaths":503},[],[],[],{"title":451,"subtitle":452,"order":436,"photos":492},[493,494,495,496,497,498,499,500,501,502],{"src":455,"caption":456},{"src":458,"caption":459},{"src":461,"caption":462},{"src":464,"caption":465},{"src":467,"caption":468},{"src":470,"caption":471},{"src":473,"caption":474},{"src":476,"caption":477},{"src":479,"caption":480},{"src":482,"caption":483},[],"pages",["Map",506,507,530,531],"fitness",{"id":506,"data":508,"body":510,"filePath":511,"digest":512,"rendered":513},{"title":398,"description":509},"Tracking my fitness journey","Tracking my fitness journey, workouts, and progress towards a healthier lifestyle.\n\n## Current Goals\n\nComing soon...\n\n## Progress\n\nComing soon...\n\n## Workout Log\n\nComing soon...","src/content/pages/fitness.md","97b3aacb54c77fc8",{"html":514,"metadata":515},"\u003Cp>Tracking my fitness journey, workouts, and progress towards a healthier lifestyle.\u003C/p>\n\u003Ch2 id=\"current-goals\">Current Goals\u003C/h2>\n\u003Cp>Coming soon…\u003C/p>\n\u003Ch2 id=\"progress\">Progress\u003C/h2>\n\u003Cp>Coming soon…\u003C/p>\n\u003Ch2 id=\"workout-log\">Workout Log\u003C/h2>\n\u003Cp>Coming soon…\u003C/p>",{"headings":516,"localImagePaths":526,"remoteImagePaths":527,"frontmatter":528,"imagePaths":529},[517,520,523],{"depth":28,"slug":518,"text":519},"current-goals","Current Goals",{"depth":28,"slug":521,"text":522},"progress","Progress",{"depth":28,"slug":524,"text":525},"workout-log","Workout Log",[],[],{"title":398,"description":509},[],"reading",{"id":530,"data":532,"body":534,"filePath":535,"digest":536,"rendered":537},{"title":433,"description":533},"A curated journey through books and ideas","A curated journey through books, articles, and ideas that shape my thinking.\n\n## Currently Reading\n\nComing soon...\n\n## Finished\n\nComing soon...\n\n## Want to Read\n\nComing soon...","src/content/pages/reading.md","6c38f533ac2810d6",{"html":538,"metadata":539},"\u003Cp>A curated journey through books, articles, and ideas that shape my thinking.\u003C/p>\n\u003Ch2 id=\"currently-reading\">Currently Reading\u003C/h2>\n\u003Cp>Coming soon…\u003C/p>\n\u003Ch2 id=\"finished\">Finished\u003C/h2>\n\u003Cp>Coming soon…\u003C/p>\n\u003Ch2 id=\"want-to-read\">Want to Read\u003C/h2>\n\u003Cp>Coming soon…\u003C/p>",{"headings":540,"localImagePaths":550,"remoteImagePaths":551,"frontmatter":552,"imagePaths":553},[541,544,547],{"depth":28,"slug":542,"text":543},"currently-reading","Currently Reading",{"depth":28,"slug":545,"text":546},"finished","Finished",{"depth":28,"slug":548,"text":549},"want-to-read","Want to Read",[],[],{"title":433,"description":533},[]]